{
  "the-glu": {
    "user": "the-glu",
    "statsGlobal": {
      "nbCommits": 63,
      "nbWordsMessage": 254,
      "messages": "Fix doc Dont request policies when the token dosent have access to them Improve documentation and fix whitelines Automatic groups/teams Code import There is no SanitizedTextField in forms ^^ Missing import Remove debugging print Merge pull request #4 from llann/master\n\nAdd badges Pip fixes Merge branch 'master' of github.com:the-glu/django-tequilla Version 2. Rewriten with requests, setup.py, general cleaning, user updating Fix multiples names Merge pull request #1 from llann/name_correction\n\nName correction to => Tequila Fixes Fix doc Improve doc Import form old version Lastest version Update dotfiles Add cpp<->hpp Better cursor Add true color by default Added quick-scope Add ctrlp and vim-devicons Neovim alias Wrong file for some options Correct ditry function ZSH Config Completions fixes Error with HTML files Vim files Added conkyrc_fixe Conky Symlink scripts Remove dot Added .screenrc Update CMakeLists.txt Initial commit Fix useless warning in addTextureMesh\n\nIf only one texture is used, display a warning about the GPU allowing only one texture is useless :) Fix typo in error for extrinsic parameters Typo in dockerio doc (#34244) Update Dockerfile Install correct debian package Missing npm install Allow to search users Missing restart for real-time service Use -e :D Update Dockerfile Update Dockerfile Update Dockerfile Allow to increase the number of dialogs to backup Ugly hack to increase download timeout to fix #3 Fix #4 (Missing yaml dep) Fix #5 (Missing `by_ids` folder) Fix #2 Dont crash if no printname Update README More robustness Make script more robust and add warning Messages with no date are not a reason to stop First version Initial commit ",
      "nbWordsMessagePerCommit": "4.0"
    },
    "stats": {
      "Python": {
        "language": "Python",
        "nbCommit": 33,
        "nbWordsMessage": 147,
        "nbWordsMessagePerCommit": "4.5"
      },
      "Arduino": {
        "language": "Arduino",
        "nbCommit": 1,
        "nbWordsMessage": 2,
        "nbWordsMessagePerCommit": "2.0"
      },
      "Shell": {
        "language": "Shell",
        "nbCommit": 22,
        "nbWordsMessage": 54,
        "nbWordsMessagePerCommit": "2.5"
      },
      "C": {
        "language": "C",
        "nbCommit": 1,
        "nbWordsMessage": 2,
        "nbWordsMessagePerCommit": "2.0"
      },
      "C++": {
        "language": "C++",
        "nbCommit": 2,
        "nbWordsMessage": 30,
        "nbWordsMessagePerCommit": "15.0"
      },
      "HTML": {
        "language": "HTML",
        "nbCommit": 1,
        "nbWordsMessage": 5,
        "nbWordsMessagePerCommit": "5.0"
      },
      "Ruby": {
        "language": "Ruby",
        "nbCommit": 1,
        "nbWordsMessage": 9,
        "nbWordsMessagePerCommit": "9.0"
      }
    }
  },
  "BinaryBrain": {
    "user": "BinaryBrain",
    "statsGlobal": {
      "nbCommits": 1584,
      "nbWordsMessage": 5367,
      "messages": "Moar data CSV to UTF-8 Add script to put opendata Merge pull request #1 from Flagoul/master\n\nFixing a bug when 0 batonnets Update README.md Fix FF issue Fix FF issue Add Lora font Add demo link Improve demo Fix typo Add CSS lib Add interactive button to the demo Add safety if called multiple times Update readme Move demo in a dedicated folder Add min version init Initial commit Add main file Initial commit Add install instructions Add packed extension init Initial commit Add button style Display labs data on click Add Point Fix style Add geolocated points Add Location buttons and divs Date default value Add Dates Add Geoloc package Update collections, add Opinions Locations Data collection meteor init Initial commit Add comments Fix typo Fix typo and add graph section Reduce background size Update README.md Update README.md Update README.md Add error message when you do not have any fans... (I am sorry) Add style and font Fix bad CSS Add links style Add graph using random colors Add style Add background Add error handler and remove the user from fans list Fix typo Fix comment in JSON Add content in README.md Simple working site ES6 is not that well supported :( Merge branch 'gh-pages' of github.com:BinaryBrain/BestFan into gh-pages Add user to URL Update README.md Change data display List and count users that stars your repos Initial commit no more smiley Freeroom!! make me a sandwich Replacing Claris by Cleverbot and vice and versa Handling HTML entities removing html stop spamming cleverbot Cleverbot hear everything console logger calling a method is better than show its code Adding prices on PF ça va Salut: caps the 1st letter disable scripts Correction du Jeu Jeu Remove Lost because she loops I lost the game Salut Claris! whoami We all love XKCD Better Doc Polyfood is awesome get ratio Setting ratio command ratio: 0.3 Claris answer with a 10% ratio removing Pugs Adding Cleverbot. Removing ship it .gitignore Skype4Py Better script run script Adding Hubot Initial commit README is md 1.0 version init Full report link typo² typo :smile: Update README.md gname => name Style fix click row bug Fix buttons Fix Insertion and Deletion glitch on server fix clicable rows fix buttons Insertion and Deletion Insert data appears correctly technical infos Client side UI Doc. Server side. Insert form Fix fullscreen tabs Fullscreen mode Delete works Update README.md Update README.md Update README.md Update Screenshot in README.md Update README.md Changing titles fix search bug Update README.md screenshots Removing ID_ columns in output typo escaping Oracle chars Fix button output display sanitize SQL in JS SQL requets on buttons Add all requests Case insensitive search clic by row on data Fix concurrency issues liek a boss Fullscreen mode Ajax loader and Tabs typo Add JSON Response Search by table typo Client-side DB Structure LIKE and UTF-8 support sending JSON Handling DB connection errors sending a basic search request to the server Custom search instead of Custom SQL Request Client handle correct json response. Database <-> Java connection JSON response test Fix SQL types create queries file Using GET. Working web server. Comments Handeling index.html Handleing 404 It works sending source code getting filename from URL Worker is responding Printing server port Basic Java HTTP Server Fix debug console Debug console Create buttons. Style. Init client view and libs User-friendly folder Ignore data folder Instructions Initial commit Better logs Fix loop Fix #1 and add date Fix login part Update README Add gitignore Add simple README Init change default port dynamic behaviour and arguments renaming files Initial commit Removing zeros (it was aweful) Using sin instead of Math.sin splitting into many files. Trying to make it work everywhere. Better Readme Releasing my work: \"Fly. You're free now.\" Initial commit Update README.md TAB duplicate things No more TODO removing useless methods (just calling super) Fixing wrong order comment at end of line Tabs => Spaces Comments and order Replacing TABS with SPACES. (Dumbest thing I ever heard) Duplicate strings Cheater! Checkstly Update timeSpentHW5.txt\n\nYou were close ;) Removing old files treating and returning SQLite questions Trees everywhere Tree of question IDs instead of QuizQuestions Structure of the Tree :evergreen_tree: and TagStorage :file_folder: Time spent :clock3: Search Question: query() next and from Adding query() and on(..) to the SearchQuery class. Refactoring a name Sorry for the remaining syserr Using AuditErrors and fixing @Elieva's code Adding auditErrors for EditQuestionActivity @philemonf CHECKSTYLE PLZ Fixing #3 (QuizzQuestion audit), please test your code @philemonf Removing and correcting some old TODO and FIXME Typo. Shame on you, Andy!! auditSubmitButton Repairing Philemonf errors. removing audit calls Audit Button autitButton method (not implemented) Readability Checkstyle checkstyle removing unused EventScheduler Checkstyle, guys... Checkstyle Update timeSpentHW3.txt Moar tests Refactoring SharedPref to store User Session EditQuestion has a sessionID in header Auth is terminated and workin Clearing fields, writing error Correction Auth and handling some (every?) errors Progress Dialog while login Preventing people from spamming the login button Authentication work but doesn't handle errors Typo in a URL Auth still not working but almost. Double Android Manifest is weird Auth doesn't handle errors Removing old boolean. Handle JérémyBreakEvents Exceptions. Events. Events everywhere. Event example is not a test. Modern Event System Base for Tequila Sacha's time Sacha's one Adding managers in the README Create README.md Dance Level finished 2-1 Poro's Rush New Backlayer Update level2.txt Wallpaper Overworld Level 2-3 tiles finished. Can be improved. Level 2-3 not finished new overworld Rocket! :rocket: Rocket Hitbox and R on lvl2 Rocket Asset Rocket Base and Metal Tile impl CRAAAAAAAAAAAW CRAAAAAAAAAAAAAW Tiles and Overworld tiles Tuto fixed The Birds Working version Raven Crash Work and working modern level Modern stuff raven's collision Raven modern assets Include string coding conventions fix level3 ignoring obj folder Moar joke in README Update README.md Update README.md Update README.md Update README.md Update README.md woosh fix bad const name wooshes new Bonus Colors title img sorry guys PORO *O* bonus FPS drops lower Fullscreen const Death Music for Dead people death music comming from a low quality speaker renaming castle main tile Fix a music glitch and move DLL remuting Fix footsteps Fix Mapper.js Animations are correct bugfi sounds and refactor Behehehehe Footsteps are back SPIIIIIKES remove mapper info Make Spikes more visible Muting sounds and mute by default check if a point is outside of a view Press 'M' to mute names and consts Centering camera at the begining of a level Updating CBP. Bad guys @Gerardufoin Cause the music makes me feel alright! Ignoring saves Correcting rapidJSON Moving .exe to the main folder and .dll to libs folder. Multiple screenshots with F12 Fixing Mapper destroying unused sounds Fixing encoding Closing streams. Multiple entities walking in the grass make some noise little rework on elodie.png Correcting Elodie Sprite Position New clothes Zoom issue Setting gameView in constructors of displayable moar const Adding warning when tile not found Immersion bar value in const.h Sorry for the Fullscreen Boundaries are almost working. Sound manager handleing random sounds Add a `= 0` for @Flagoul Press A to play a sound, SoundManager working. Zoom level = 2 Mazda - Zoom Zoom Sky class Texture Manager working deleting TitleMenu SEGFAULT adding Texture Manager to the project Reorganizing sprites, Texture Optimization Texture Environement Beginning of LevelEnv and gravity scaling Port from my WinJS app Initial commit Add counter to pie chart legend Add type pie chart Start graph to zero Fix timezone bug Add legends Add website to readme Add Lausanne GPS coord in api instructions Add API Instructions Basic API Chart, change collection schema, style, stuff Add style, bugfix Bugfix Add login and all types of FF Add DB, basic form and home page Add useful packages Init meteor app Initial commit Update README.md Checksum comments comments useless TODO removed File not found Clean Date and linux-like-permission less debug prints File size new permissions Set attr getting full long name chunks Check flags typo long file names NO_FILEname debugging attempt to read dir fat_boot in vfat_info isFAT32 Music merge was dead music Bigger Skybox crash conditions faster missile Moar ignores captures Stylish missile is no more physical. formating again Folamour is flying missile Sky!!! beautiful conflict resolved missile cameras DO work Oculus recalibration typo Update README.md bridge little modif bridge Wall1 Base Model todo move forward Fix Oculus better oculus loading Oculus Working terrain0 js basic terrain Oculus Support cube model Correct indent less cubes... include Oculus Effect terrain Do a barrel roll! Oculus Three Effect decrease mouse speed Oculus Status Oculus Handler! Add Oculus Bridge Add three.js init client Oculus Bridge Initial commit Tweets are laggy on iOS, so I let text tweets on mobile. Fixing tweets width on mobile Adding link to the project. Little fix. Pop Over works on every type of screen. Correcting broken code Cleaning, refractoring, preparing. Centering tweets. Adding code for graph in the folder but it only work on IE (ActiveX). Aweful redirection to avoid deadlinks. Tweets are always beautiful, now. Animations are disable on mobile. Sexyzing Pop-up. resizing pop-ups, adding Tweets Trying to load tweets Logo... at least... pop-OVER. Images Pop-ups are working so great. Styling the popover What a nice frontend. Pop-ups are missing, but they are coming. Correcting Frederic's messy code. (noob) Adding files for the popup. Adding a basic Map by Google. Basic frontend in Bootstrap Dummy game list ignoring those damn Thumbs.db Draft: iframe communication stahp spamming the console ping Refactoring, EventDispatcher, Actors renaming login by email, login-success returns person Better Auth, removed me on server, cannot chat with yourself Refactoring Client Timezone should work better, now. Chats are working again. Revert \"unify login\"\n\nThis reverts commit c8353939f3957184888dc4751a569734b2e02744. unify login dummy login comm Sessions, Better Users Chat fully linked to the DB. Messages are store in the DB Moar Relations More Models Lot of stuff, lot of hacks. Comm, DB, Slick, chat, etc. Update README fix websocket data recieved websocket problem with multiple requests People are loaded with websockets still working on WebSockets Sending a dummy people list Working WebSockets Play serves the client move client view drafts doc Angular dummy chat Play Server AngularJS and basis of a chat Update README.md Create README.md Fix stuff but not all Fix orders Add Journal Output Fix deliver Add Journal load Add ids Change item representation Fix stuff Add giveOrder Add dist and travel to Drone Fix and test Journal Finish Journal Object Finish Warehouse class Init Warehouse Finish Drone class Add Drone Create README.md Update README.md Update README.md Create README.md final Splitting into multiple files. Formatting Normalize ouputs work from Simon init 05 15 MD 1st final version merging fail merging files rename bis rename Update README.md Labo 4 init Final tables table test Moar Markdown! typo result of 16 corrections markdown Markdown init requet and question 25 done 23 done request 22 done request 21 request 18 done clean up requets 14-17 requests 10-13 Lab 02 - files SQL create PDF final Corrections 6 should be finished imporving 6 imporving 6 Begining of 6 Exercice 5 Modification 3 UML 3 output in file refactoring reading files word by word regroup stuff Separating hypotheses Unsorted set for CloseWords CloseWords typo in gitignore typo in gitignore mv old stuff init labo 5 old stuff Questions 1, 2, 3, 4 finies Answers 1 and 2. Clear shortestPath Dijsktra works from any sources RoadDiGraphWrapper.h 1st compiling version :) work in progress... Find Cycle Woops add consts in SymbolGraph GraphUsingAdjacencyLists from Labo 2 Util from Labo 2 unzip Labo3 initial commit gitignore Optimizing ex3 ex 3 - final ex2 almost working Moar ignores (bin, obj, C::B) thanks zip for creating useless folders unzip no more accent init Labo2 init Initial commit Render 7.3 kind of done (matrix is 2x2) 7.1 done Create dataset Ignore pyc Add list all file change path Add python files Add sound files Initial commit remove MacOS shit JUnit Labo01 done Gen Labo 01 - beggining Initial commit Create README.md progress bar works Initial commit new PDF Update rapport.md Update rapport.md init labo 08 Rapport PDF final Corrections Schéma et Rapport Old stuff new Lecon constructor, static horaire Lecon constructor formatting split classes into files TODOs skeleton of Groupe.java and Lecon.java Consigne rapport and Formating Update rapport.md Headers Update rapport.md Create rapport.md Welcome to the matrix packaging v1.0 typo Operations (Or, And, Xor) init operations Lab 05 PDF Final Int created. Ex 2 done. init Lab 04 Initial commit Needed files for generated Rmd. Update New environement. Rmd is powerful. Exercice 2 in progress Merge branch 'master' of github.com:BinaryBrain/R Data :floppy_disk: Create README.md initial commit :octocat: extract zips init labo2 Code Labo1 Initial commit Labo 02 done Add Labo02 Lab01 Initial commit transparent png printing stack trace EER-Diagram correct encoding Js comments style JS votes Votes polish admin Scala comments move api ref Typo update ref Charts! And menus API fix remove null value in admin Polishing Style Better nutriments display Nutriments working, Admin Working, Everything's good sql refactoring Basic admin view and routes Nutriments, Types order, day shift fix, style, refactoring Nutriments API safe menus download Correct foreign keys updating database Better look on Android Cleanup remove heading, open automatically today's menu Accordion Correct dynamic MIME type Cascade everywhere Add menus only once Nutriments Table, refactor DB, Improved Client, Downloading and Inserting Menus Menu case Calling MenuDownloader Ajaxing the menus Get menus by range Basic menu view Play responds PhoneGap pages Display menus by date ignore Thubms.db Android init and Angular remove println working menus API (/api/menus) API Reference Slick DB Init Index, Add deps, init DB Cahier des charges -> README Cahier des charges -> README typo init play Menus Initial commit better paths Note and Boldness typo Readme: context of the project Volume works only on mac typo changing an image reducing an img size readme update images Readme cleaning final Working version Finished on iPad remove sox for OSX sending HTTP requests Working UI refactoring Initial commit More presets init better scores Merge pull request #1 from Protectator/master\n\nUpdating score calculation Update README.md Update README.md first version Initial commit Remove file removal Add manifest name in AssetGroup Allow to change the bitrate lower the bitrate Update libs fix axis Faces are now display correctly! Up is now up. Supporting more files variations Pushing the old work Initial commit Initial commit Initial commit Try again? Game is harder jquery is local. Game Over is cute Plateforms are working Clean Game Over many things Adding helper Adding Lauretta sprite Game over function Score Solving a bug with controller, adding M for muting, adding music Intergrating images, adding Camera little mistake Correcting loading Adding folders and music Adding a Camera following Lauretta. initial commit Initial commit Delete rts_express_live.pdf Delete remarques.md Update README.md Rename rapport.md to README.md Add Xcode bugfix Add Manuel, metadata file specs Cahier des charges Add perfs pics Corrections, validations, etc. Add a word lol Add specs Add date and ref Relecture Typo Style, Screenshots, UML, etc. Add Fonctionnement and Améliorations Fix spelling and add app Add Video Intro Conclusion, Problèmes, ... much work Fix filename Add TODOs, improve intro, remove cahier des charges rapport intermédiaire Add référence more text init White Balance Bind Buttons Fix red/green pins Add control with pi-blaster Add communication between client and server Add ColorPicker ignore node packages Fix JSON API Change API again Improve README style api Initial commit New design for the fnu Fight Style Better Dialog Dialog methods (taken from deprecated Console) Facebook on Firefox! Better doc Facebook.getNamesFromID() is working with arrays Arrows New Style Facebook getNameFromID Remove doublon removing an old console.log Team is now dynamic New and better initialization. Cleaning console.log FB Not a friend handling removing that so slow fade Teams demo Must use callbacks Adding team and history files Adding indexedFriends EnemyChoice is now dynamic Adding a welcome message Facebook.js inits and works Facebook and Dialog better CSS class fix adding a class to views Adding views install-server script Changing port to avoid collision Readme stuff Initial commit Removing a dev tile Update README.md Update README.md Removing old stuff Adding progress indicator. Minor change. Adding Flight mode on the Readme README corrections README corrections Adding the flight mode, README improvement. Adding a sleep to prevent Google's anti-spam messages. Modifing README New README Adding montage command for the final image The script can download tiles. initial commit omg kgsh sdfjn2 trainers fuck corr lol saf moar clear console.log sdélkfm attack buttons adding a drawAttackDialog(a1, a2, a3, a4, cb) oupa anti-plantage border on the canvas sdkjghb type things and stufs Unbinding buttons new buttons Get Friends from FB dat fkin typo dat fb iz workin dat fb 4 dat fb 3 dat fb 2 dat fb Testing a JS FB Auth Menu mistake Hiding Console Handling New Fight fu Synchro Typo Init is now in Controller debuging Dat alert oops Draw Dialog and Draw Button userid Woops Bettr functions Moar functions deleting facebook useless test adding facebook test page HERE IS DA FILE Adding the socket.io lib network.js improved Improving Com Basic client com Adding some more com events Adding some specs for the com between the server and the client. Creating the network file Adding the website link New name Initial commit fix folder exists bug init Fix building glitch Add computing percentage Handle relations, every buildings, and much more! README: OSM JSON format raw OSM XML data Use official OSM API Fix buildings Update README.md Fix buildings height Buildings! Stick worlds to the floor Update README.md Ignore bin and obj Fix interpolation. Cervin is working! ignore bin and obj remove old generated maps Max: 256 Yargs! all elevation is a key again Manhattan, guys small modifications building nodes using new OSM json elevation.json Bilinear Interpolation creative mode map Update README.md elevation removed. Update README.md\n\nelevation-flat Without BOM Flat elevation map Elevation maps Final elevation json without interpolation Meters from [0,0] to [1000,1000] Normalized maps clear map Get key elevations fix osm-data strings get elevation tests minecraft flat map ignore node modules Initial commit Handle relation in XML Update README.md Create README.md concurrency test assignment 1 init report Final Version Persistance Add Data Handling. Working Version. Working Layers and Windows. Menu code Dual screen, highlighting Init Initial commit Show username instead of email Fix spinner Prod mode Update UML Add spinner when downloading songs Change Favorite to be like others Download songs only once Using username Add view to list user playlists Add clarity on friends Adding friends is now possible. Add link to origin url in playlist Discover is better UPDATE SCHEMA, Add friend model and controller, Add friends show view Dammit Firefox... Fix the fix Fix strange bug in Chrome where the audio is still playable without the tag. Add play/pause with spacebar Fix style again Fix style Player design Remove useless stuff Add favorite system Put title in the layout Replace My Playlists to Playlists index, style Replace My Playlists to Playlists index, style Add player Add song is working Merge Add Song and New Song views Fix song download My playlists shows only yours Remove user_id field in new Playlist Fix name conflict Fix models Add auth system Add auth gems Add discover as root Add style and view init Rails server Replace README by report Fix git merge bug Add UML to report Add UML Add features and improve iterations Add Description and iteration draft Init report.md initial commit Fix #7 Fix a typo in the example code Update CDN and jQuery fix freeroom error no more facebook button testing for strange data update from FTP Every 15min Correcting Flagoul URL Correcting tooltip position Adding Flagoul as dev Correction des prix étudiants Adding info messages Adding Google Analytics Dat line... adding a clearing system Forgetting a line Correcting info and info:hover Adding highlighting Modals everywhere Handling Hour Facebook integration completed. adding .php for sec reason. Beginning of a Facebook integration Hide 'menu du soir' Just cleaning folders. The file is already in /js init first commit Program 2 running! Mutex protection. Lower Speed. Program 1 works. kinda working Map and Troncons init and first thread Update README.md Adding 'punch-' before every variables to adoid collision. little change Error in the Readme Resizing the readme image. Little fail. typo Adding a screenshot to the Readme. typo Adding \"Example\" section to the Readme Simplifing the call. Using mixin to style a punch. Using mixin to style a punch. Updating README Updating README Updating README Pushing my work. Initial commit Add simple README update cv Add photos hide cursor Add Gallery close button and navigation. It works! init gallery Fix URL on home page Improve home link Change slightly terrain x position Add refresh and home links Fix promise file Add promise lib for IE users and fix typo ES6 => ES5 ES6 => ES5 Add viewport remove span text Moar style Add gradient on nav New Background style Fix camera pos Remove camera traveling typo Fix webGL not rendering Sacha Bron disapear Make camera rotate instead of terrain Fix typo Add Kudelski Experience Fix terrain and stop rotation fix menu Change loading order Add router Add photo and more style Add animation on page load New font and glitch Bugfix Add Programs and Web pages New font with all glyphs cv update Add cv Fix Title style Add Brownie and clean-up a bit Awesome background (Yes, I love Flume) More style Animate terrain on page loaded Add program example and block style exception Move files, Add github-readme, Add script handling in main.js Remove span on whitespace texts Add black backgrounds on text. With a tricky functions that adds spans for it. Add whoami content Add Contact page, socicon, style and more glitches Add glitches, menu style and dummy pages Clean up Add nav links listeners Add terrain file Refactor: Add Terrain class Add change height animation Hills and name Create LICENSE Update README.md Update README.md Better page creation and destruction. better tagging final sounds Musics PNG and fade button color adding folders Scrollbars and pause sounds audio delete old divs History and scrollbar first working version init Initial commit LAST Choke-o-lat commenting in progress. GUI improvements we can disable 3D. Oublié de commit avant de changer d'ordi... GUI is drawing planes Events in the GUI. GUI is totally correct, now. Adding routing stuff Plane excessive speed corrected. 8765 The GUI change with your resolution. (limit: 1500, 950). Adapting 2-3 things in 3D-view. Planes should be correctly rooted now. They can go straight/circle/land/destruct (not NONE). Cleaning asset. Adding Routing algo. Adding the Gripen, adding routes file and route parser. GUI should be OK, now. reforgering GUI removing useless stuff GUI Panels are working. RÉPONDS QUAND JE T'APPELLE. Tweets are totally working. Twitter Class is deprecated. Using TweetSender with Twitter4J now. 3D GUI is now in a JFrame. Gui Aircraft's trace is working. Aircrafts have a path, and are automaticly oriented. Improve GUI 3D: The cam rotate at the first person point of view now. small modifs 3D: Separating control manager from the Radar View. Adding 3D View, Aircrafts, World, Cam, etc. Trying to add an OpenGL View File Transfert almost complete (hash algo is missing). Merge branch 'master' of github.com:EvoDev/SAT Creating a Twitter implementation. Ajout de \"toString\" I'm a teapot Les Messages ont une méthode toString() Merge branch 'master' of github.com:FredericJacobs/SAT\n\nConflicts:\n\tsrc/sat/radio/message/MessageFile.java Refonte des SegmentableFiles Avancée sur DataFile Merge branch 'master' of github.com:FredericJacobs/SAT Refonte de Radio\nPlus d'enum sur les messages Merge branch 'master' of github.com:FredericJacobs/SAT\n\nConflicts:\n\tsrc/sat/radio/Radio.java modifs mineures Création de la structure pour les Messages. Merge branch 'master' of github.com:FredericJacobs/SAT Création des Classes Message, Radio et Encoder. Creation des classes pour le RSA.\nDébut d'implémentation. Allow offline mode and fix timestamp Handle Shooting fail error Timelapse interface, bug fixes Add timelapse feature Add picture link typo Add README Add Movie mode, automatic shoot mode detection and toogle Broadcast liveview, fix 0 client liveview crash, disable/enable buttons Add liveview Take picture and focus features Move from handlebars to Vue.js init README more clear Add js readme Clean js and scope it Unzipping folders Adding an 'Ajax loader wheel' on teams little improvements Adding images for dev purpose Adding a login screen Adding a cancel button on the Team frame. Adding a Notification system. Totally working ;) Dynimism Adding a Team Making Frame. improving main view New design, new ideas, new cleaning, new refactoring. Disabling invite button on client-side Groups are updated on client-side too. Groups are working perfectly. We just need to handle disconnection, and it's done. Interface don't show yourself. Server-side invites should work fu Using Rooms for Groups. Better Test Interface Better MD Better MD Player list auto-refreshing Interface shows a list of players when connected. cleaning the kitchen Show alert to the client when errors happend. Big work with Socket.io. Nicknames are now checked. Modification des Specs et du readme. Ajout d'une favicon et de petites modifications. Ajout d'un fichier de test de socket. Avancée avec Socket.io Ajout d'un fichier de spec du protocol de communication serveur-client Node server basic working setup. Preparing for the node server Adding verbose. Little improvements. Adding the main structure and a lot of useful functions. Creating engine . Adding maps demo for Flagoul initial commit Initial commit Lab done Every tests are OK Utils works File Numbering Filter Works UpperCaseWriter works DFS works Author's email ignoring more files (Idea, tmp, Java) Apache conf is no longer updated everytime Heartbeats update the Apache conf bugfix Heartbeat Handler Hearbeat script for backend Update README.md Create README.md little corrections fix triple Adding correct triple Let's drink Merge branch 'master' of larasrv05.epfl.ch:cc2013-group05 little improvement on Primes removing old Primes.tool Merge branch 'master' of larasrv05.epfl.ch:cc2013-group05 Correcting last commit showing primes Primes.tool Fixed and Moved Merge branch 'master' of larasrv05.epfl.ch:cc2013-group05 Primes.tool init Initial commit Send error as Json, fix style Update dependencies Create README.md twetter-getter keep running on error Tweet-Getter can now be installed globally Rename tweet-getter app Doc and stuff Delete test.js Change filter behavior to AND from OR. Twitter options geoloc is working properly First prototype of the getter: tweets from Lausanne Twitter lib added docs done wake queue Barber omg it works work in progress fix url Remove useless buggy footer Add answers with much Angular2 professionalism Fix all\nBASE_URL Add redirection Add more working stuff Add controler to participate Add Participate Interface. No controller behind it. Fix lame TS errors Fix polllists buttons Fix poll creation Add createPoll socketio handler on the server Fix indent refresh page like a goret on login/logout Logout button works Redirect after Signup Fix Jade Warning Delete old router Add Angular2 router.Change Angular2 template location so Express can compile Jade and send it to Angular2. Fix default gulp Add Gulp and gulpfile for Typescript compilation Add Angular2 API is done. API Doc is done. APIDoc pretty much done more apidoc GET Poll doc PUT is working Add GET, POST, DELETE polls and participants Create and update polls Get all polls Move models to models folder, Create API route Re-add api specs Update api.md Add HTTP status for GET Polls Add GET Polls Add POST, PUT, DELETE for Questions in the API Add Status Fix typo Add GET Questions API Init API.md Add container-fluid pulling test Merge branch 'fb-lab02-tests' fix tests V1 tests and V2 init Checksum comments comments useless TODO removed File not found Clean Date and linux-like-permission less debug prints File size new permissions Set attr getting full long name chunks Check flags typo long file names NO_FILEname debugging attempt to read dir fat_boot in vfat_info isFAT32 Update README.md fix colors again Fix color cycle fix color shift in legends Cycle through colors Optimize fonts more predefined colors Remove dummy dataset Add simple basic spinner when loading data. Could be improved. Adding stuff to dataset Charts handle every colors Change moods colors Add more colors Add dummy legends Remove topic and fix form size Improve form style Add tabs for forms Fix design and add ribbon Fix less callback with a hack Change Paragraph Font Add Modality Fix case Change palette, add Number of word per sentence Update README.md Update README.md Update README.md Improve Style and Add App Name Add lengends on the triangle Add function to add a pin Add info box on hovering pins Add Triangle and Pins in pure CSS3 Create View and Index Update README.md Make badges bigger Move name in img title Add reactivity for a better demo Add another level for a better demo It works Add god level Fix level bar Add next level management Fix reputation for real, now. Fix get reputations remove useless todo Create a new AMT endUser Change minor style Add Dashboard Add Sign In Style SignIn with GitHub is working Fix typo Fix button Basic GitHub auth to get a token Add iron router and http Update README.md Update report.md Add conclusion Add Demo description Update README.md Update README.md Update README.md Add home-fail screenshot file Add demo screenshot files Add Screenshot files Add UML to report Add UML Add Location on Levels in API doc Add POST example in API doc Add event API doc Add reputation API doc Update Badges and Levels API Doc Init gamification app Add level deletion Add Basic Event interface Fix null values Add level deletion Add Badge deletion Add definition and placeholder for ApiKey input Add level manager Add ability to change api key Add possibility to add badges from the demo Refresh Badges is Working! Fix names fix a bug when trying to get an app by its ApiKey Create README.md Fix errors in a drastic way. Sorry. api-key is now apiKey Add constructors in BadgeDTO. Change to ApiKey from String Remove default headers Add Levels Add Menu Demo Work in progress Add Test Badges Add Meteor Methods to call the API Fix errors Add GET badges request from the meteor server Fix API Add Home, Add New badge feature Add Basic Admin Mockup Init demo meteor app :rocket: Clean API-doc Add API doc for Badges Remove useless default headers Fix lookup bug on Linux. Avoid using java:global Add link highlighting Activate Enable Button Scripts Enable button is dynamic Remove Mock DB Add Apps Manager and Data Store Update .gitignore Revert \"Revert \"bla\"\"\n\nThis reverts commit 6c8e868ccf7ea75fce12be93109c251b0f5b79dd. Revert \"bla\"\n\nThis reverts commit 42d5798c57a90ca22898992305b5471c1b68248d. Add Account Edition View Simplify data access on views Add Dummy values from the controller on Home Add List Users View Add App Details view Change Homepage Make Dashboard Menu an Include Add Static Register New App Add more link to the dashboard Complete static Dashboard Add dashboard menu Fix registration method Fix cancel button on registration Link to the registration page Complete Registration View Add Basic Servlets Add views Ingore Idea Files Fix markdown Update README.md, resolve #1 minor, stop printing the level Gravity :earth_africa: :rocket: :moon: another test level 3 hours later, exactly the same result. Camera is following Elodie with some nice boundaries haaaaaaaaaaaands changing camera center in levels EntitieVector is now EntityMap :dancer: Patching a memory leak :non-potable_water: Correcting the doc :pencil: Correcting the doc :pencil: Map's margins are no longer required. :triangular_ruler: Optimizing Mapper.js :fast_forward: Removing useless cond in TileSet :space_invader: Correcting a sprite and finishing allsprite.txt Mapper.js updated Tiles. It works. :tractor: Mapper.js :hatched_chick: Mapper.js :hatching_chick: Little improvement on Elodie Improving readability Commenting Entities->Entity and showing Elo in Levels Top-left and top-right New tile format and test map. setSide improvement Beautifying Tiles and Printing the level move has nothing to do here adding env Printing levels, like a boss Emptying toDraw. Sorry for the lag ;) Adding GameView GameView has a Drawable vector to draw. Refactoring, GameView, Level Little stuff Adding dev texture to tiles Refactoring Turning Warnings into Errors. removing toCharArray MapParser is now known as Mapper. Implementing Game Removing ultra verbose Awesome Graphism and Overworld. deprecaded FIXME Modifing TileSprite Constructor Adding a namespace to TileType woops Little refactor of the printer Correcting Parser Adding MAP_NULL in the parser Changing the title name C++11 Flag Champagne!Map Parsing is working! Game, Map Parsing, Get String from files cbp. Again... Removing doc and Example of RapidJson Improving Map Parsing Correcting a warning And saving project... Map parser and printer, Entities, Level, etc. Sprite Classes, test level, Begining of Map Parser Game file Updating Title Ignoring .db linking Animated Sprites Libs *.a linking for Debug and Release in CBP ignoring CB Layout SFML, CBP, Windows stuff Update README.md Update README.md Initial commit ",
      "nbWordsMessagePerCommit": "3.4"
    },
    "stats": {
      "JavaScript": {
        "language": "JavaScript",
        "nbCommit": 699,
        "nbWordsMessage": 2343,
        "nbWordsMessagePerCommit": "3.4"
      },
      "HTML": {
        "language": "HTML",
        "nbCommit": 4,
        "nbWordsMessage": 11,
        "nbWordsMessagePerCommit": "2.8"
      },
      "CartoCSS": {
        "language": "CartoCSS",
        "nbCommit": 14,
        "nbWordsMessage": 39,
        "nbWordsMessagePerCommit": "2.8"
      },
      "Python": {
        "language": "Python",
        "nbCommit": 71,
        "nbWordsMessage": 249,
        "nbWordsMessagePerCommit": "3.5"
      },
      "Arduino": {
        "language": "Arduino",
        "nbCommit": 4,
        "nbWordsMessage": 9,
        "nbWordsMessagePerCommit": "2.3"
      },
      "Java": {
        "language": "Java",
        "nbCommit": 313,
        "nbWordsMessage": 1139,
        "nbWordsMessagePerCommit": "3.6"
      },
      "C++": {
        "language": "C++",
        "nbCommit": 223,
        "nbWordsMessage": 749,
        "nbWordsMessagePerCommit": "3.4"
      },
      "C": {
        "language": "C",
        "nbCommit": 62,
        "nbWordsMessage": 136,
        "nbWordsMessagePerCommit": "2.2"
      },
      "Scala": {
        "language": "Scala",
        "nbCommit": 37,
        "nbWordsMessage": 138,
        "nbWordsMessagePerCommit": "3.7"
      },
      "Jupyter Notebook": {
        "language": "Jupyter Notebook",
        "nbCommit": 10,
        "nbWordsMessage": 28,
        "nbWordsMessagePerCommit": "2.8"
      },
      "R": {
        "language": "R",
        "nbCommit": 8,
        "nbWordsMessage": 27,
        "nbWordsMessagePerCommit": "3.4"
      },
      "Shell": {
        "language": "Shell",
        "nbCommit": 16,
        "nbWordsMessage": 58,
        "nbWordsMessagePerCommit": "3.6"
      },
      "Ruby": {
        "language": "Ruby",
        "nbCommit": 47,
        "nbWordsMessage": 196,
        "nbWordsMessagePerCommit": "4.2"
      },
      "XML": {
        "language": "XML",
        "nbCommit": 1,
        "nbWordsMessage": 2,
        "nbWordsMessagePerCommit": "2.0"
      },
      "ApacheConf": {
        "language": "ApacheConf",
        "nbCommit": 5,
        "nbWordsMessage": 19,
        "nbWordsMessagePerCommit": "3.8"
      }
    }
  },
  "BasileChatillon": {
    "user": "BasileChatillon",
    "statsGlobal": {
      "nbCommits": 74,
      "nbWordsMessage": 575,
      "messages": "can now generate and the redirection is good Création des nouveaux servlets format and fix import all api functions working, need now to implement them in web le bouton delete fonctionne Merge des methode Rest en une methode DogRessource sur le /dog fix modification used to debug doc tentative de création de l'URI pour suppirmer non fontionel résolution de bug, test de html pour itérer sur des list de manière différente affichage avec les pages dans l'url fonctionne. création d'un nouveau dog via API et suppression d'un dog fontionne projet Create README.md Initial commit refonte de IInstrument de class en interface. Adaptation de Trumpet et Flute en conséquent Implementation of Application according to specification add more comments, fix some indentations add my name in the authour, some doc for FileNumberingFilterWriter filter test working. implementation of the different transformer done. CompleteFileTransformer not working yet, because FileNumberingFilterWriter is not fully implemented yet test working for UpperCaseFilter, need to work on FileNumbering was already working, but i could not see it cause of the missing implementations of the other files fix the DFS so it finnaly works all utils test working Add the missing line in fetchAndStoreQuotes. Do not work, don't know why Fix the creation of the folder and the files in Application. not working don't know why suppose to fix the authorMail adresse. Not working, do not konw why Merge branch 'master' of https://github.com/BasileChatillon/Teaching-HEIGVD-RES-2017-Labo-02 add some docs fix merge error fix des quelques beugs Merge branch 'fb-lab02-v2-tests' into implv2 finalistaon, reste encore a voir quelques méthodes d'accès pour la cohérence des noms Implementation of v2 tests (#120)\n\n* creation of file RouletteV2BasileChatillonTest\r\n\r\n* add some new method to test the version, the port, the method listStudent and the method clearDataStore\r\n\r\n* Ajout du git de mon colègue pour les @TestAuthor. fix de la commande Bye, ajout de la réponse de la commande Load command bye and list should be ok change v1 --> v2 transfo de v1 --> v2. ajout des deux nouvelles commandes. copie du v1. --> à adapter en v2. Merge branch 'fb-lab02-v2-contrib' into implv2 Ajout du git de mon colègue pour les @TestAuthor. Merge remote-tracking branch 'remotes/upstream/fb-lab02-v2-tests' into fb-lab02-v2-contrib declaration add some new method to test the version, the port, the method listStudent and the method clearDataStore creation of file RouletteV2BasileChatillonTest evreything is working fine cration of the diffrent files and folders, the instrument part is working with node, should be working with docker update gitignore fix Header close enough test application new working code style Merge branch 'master' into pdg19_dictionary add the generated directory and files add the header in our file Merge branch 'master' into pdg19_dictionary alignment of the code spelling Translation of the documentation from French to English fix travis? fix blank Line, removed empty tests and changed sql settings Merge branch 'master' into pdg19_dictionary Merge branch 'master' into pdg19_dictionary Merge pull request #1 from Farenjihn/PDG-1\n\nPDG-1 fix indentation Merge branch 'pdg19_dictionary' of https://github.com/Farenjihn/pdg-heig into pdg19_dictionary Adding the utf-8 in the build, removing some unused import Implementing listStringNormalizer. Made Tests for listStringNormalizer, stringNormalizer, allArrangement. Need to test the perforamnce of TST and to fix test for filterRealWord cération de la structure de testes Merge branch 'pdg19_dictionary' of https://github.com/Farenjihn/pdg-heig into pdg19_dictionary ajout  des méthodes pour équilibrer les arbres. Création d'une fonction pour rechercher tous les mots à partir d'un set de lettres. test basic fait dans le main add some original spam messages Merge branch 'master' of github.com:Rhod3/Mail_Spammer add README.md, need to be completed ",
      "nbWordsMessagePerCommit": "7.8"
    },
    "stats": {
      "Java": {
        "language": "Java",
        "nbCommit": 71,
        "nbWordsMessage": 550,
        "nbWordsMessagePerCommit": "7.7"
      },
      "JavaScript": {
        "language": "JavaScript",
        "nbCommit": 3,
        "nbWordsMessage": 25,
        "nbWordsMessagePerCommit": "8.3"
      }
    }
  },
  "LuanaMartelli": {
    "user": "LuanaMartelli",
    "statsGlobal": {
      "nbCommits": 77,
      "nbWordsMessage": 368,
      "messages": "Commit labo 00 Labo 01\nFInal commit\nCleaned code Labo 01\nLittle changes in Application Labo 01\n3 files modified\nAll test are green\nComments FIsrt commit of Lab01\n6/8 files changed\n4 tests are failing Added some nice stuff Added some nice stuff Added otter pics Added some extra desing Added some extra desing Added bootstrap for web app Added bootstrap for web app Fixed problem. Must see how to call async function outside files Added tests API Added tests API Update .gitignore Update .gitignore removed file Added some modificiation Initial commit Initial commit Merge branch 'smartcity' commit for master PDF : delete comment Merge remote-tracking branch 'origin/smartcity' into smartcity correction d'un warning + erreur typo correction typo dans pdf Petit bug corrigé v2 Petit bug corrigé Suppression de certains warining v2 Merge remote-tracking branch 'origin/smartcity' into smartcity Suppression de certains warining Ajout Javadoc partie PDF Added data to manifestation on the 2nd of May. Fixed PDF bug Good PDF for work on the 2nd of May PDF connected to graphic interface. Put some data in database Merge branch 'smartcity' of https://github.com/galahad1/projetHeig into smartcity Conflit with iml Add PDF stuff, access to dataBase, not connected to graphic interface Merge remote-tracking branch 'origin/smartcity' into smartcity Fixed issue : unproper graphic size Ajout répartition des heures Précisions pour la génération de PDF Modif' du README / cahier des charges, suite Modif' du README Test1 Add somes changes Add somes changes Still no comments Pass tests with maven 191 tests pass\nNo comments yet 191 tests pass\nNo comments yet Implementation of client part 2\nNot over, still working on Implementation of client part 2\nNot over, still working on Implementation of client part 2\nNot over, still working on Implementation of tests for Roulette v2 (#110)\n\n* Add tests for roulette v2\r\n\r\n* Add ignore on tests Merge branch 'master' into fb-lab02-implementation Add ignore on tests Add tests for roulette v2 Implementation of roulette V1 Add somes changes, sanity checks Implementation of V1Client\nAll tests passe\nAdd doc 1st implementation of V1\nPasses all tests beuh >________< Changed some files First push, added all files Add readme Removed doc Add doc rapport Modify README Changed how groups are made Add modif' Add modif' Add all files for lab smtp\nAdd README Add main Add class StreamDecoratorController\n3/3 tests passes ",
      "nbWordsMessagePerCommit": "4.8"
    },
    "stats": {
      "Java": {
        "language": "Java",
        "nbCommit": 29,
        "nbWordsMessage": 154,
        "nbWordsMessagePerCommit": "5.3"
      },
      "CSS": {
        "language": "CSS",
        "nbCommit": 16,
        "nbWordsMessage": 59,
        "nbWordsMessagePerCommit": "3.7"
      },
      "SQLPL": {
        "language": "SQLPL",
        "nbCommit": 25,
        "nbWordsMessage": 138,
        "nbWordsMessagePerCommit": "5.5"
      },
      "JavaScript": {
        "language": "JavaScript",
        "nbCommit": 4,
        "nbWordsMessage": 10,
        "nbWordsMessagePerCommit": "2.5"
      }
    }
  },
  "Moufblu": {
    "user": "Moufblu",
    "statsGlobal": {
      "nbCommits": 3,
      "nbWordsMessage": 12,
      "messages": "demandes utilisateur\n\ndemandeSerie + demandeEpisode Initial commit Implementation of Application.java according to specifications ",
      "nbWordsMessagePerCommit": "4.0"
    },
    "stats": {
      "C++": {
        "language": "C++",
        "nbCommit": 1,
        "nbWordsMessage": 4,
        "nbWordsMessagePerCommit": "4.0"
      },
      "Java": {
        "language": "Java",
        "nbCommit": 2,
        "nbWordsMessage": 8,
        "nbWordsMessagePerCommit": "4.0"
      }
    }
  },
  "gcmalloc": {
    "user": "gcmalloc",
    "statsGlobal": {
      "nbCommits": 626,
      "nbWordsMessage": 3288,
      "messages": "shorter wpa_supplicant corrected a few things I really don't like sudo at all update for the test, need to be root to run the scripts adding a readme for the stats cleanup adding sentence calculator Merge pull request #2 from AblionGE/stats\n\nStats count uniq ngram adding a get the top ngram script specify any ngram size histogram for a specified tuple Merge pull request #1 from AblionGE/n_gram\n\nN gram small typo adding configuration for the job Merge branch 'master' into n_gram set run.sh to be executable correction on the run script remove the classes after compilation and generation of the jar file support for ngram and some cleaning adding make and run script imlementation in python, very naive one adding Ngram mapper and reducer test automation changing the template file extension changing the template file extension making the script compatible with python3 little correction on the readme adding a proper bash-completion generation adding the script hook cleaning binaries getting version from git or failing removing the zip option, this can be done with python setup.py bdist --format=zip moving to setup.py correction on the test making the metacafe test pass adding second vimeo url skipping vimeo for the moment adding xnxx test adding collegehumor test adding stanford open class courses adding test for vimeo, xvideo and soundcloud correcting travis changing test from md5 to filesize, the file changed between download cleaning the test that doesn't work with the api for the moment some assertion on the file downloaded removing testing video correcting test to be compatible with python2.6 StringIO used by nosetests do not merge with the way youtube-dl handle sys.stdout and sys.stderr correction on the test adding travis support correcting the makefile according to the new one removing extended globbing for the find utility adding xvideo adding facebook test adding photobucket test adding metacafe test adding dailymotion test some changes to keep the same standard removing unused global modifier correcting the makefile changing test video correction on the test for the utils.py adding clean rule in the makefile adding download test with md5 check adding TestCase class and corresponding test correction on the sanitize title method, change in title resulting adding test rule in the Makefile also patch the regex to be case insensitive correcting a strange catch using setuptool for the installation adding python3 compatibility removing unused import cleaner css removing the blue subtitle correcting dead link more python version more pedantic travis updating travis travis is good putting echo into a variable File path separator tend to change following the course of history, and the will of the user Extension separator can change too fixing some fix for fixing the test and the clean adding a cd variable to handle custom written shell String should be parametrized Fix for haiku os Alignement is important adding bootloader capabilities adding dependencies in the setup.py fixes on the exepect fixing ronmon fixing the regex for config mode removing debug log adding tests and fixes linked to an off by one error in the number of prompts update status after skipping the wizard add support for configuration wizard make ciscotator a real package adding serial support small correction for the receiving fonction handling the ssh channel a bit more abstraction fixing readme little readme initial commit fix an unicode issue when writing csv remove the network post install file\n\nthe file 55netcfg-copy-config  is run after the kickstart of the server is done. It will overwrite the configuration set by cobbler. fixing wrong class name take the testpool for latency analysis from the testpool fixing typos Merge remote-tracking branch 'upstream/master' fixing sigchld correcting the readme\n\nTypo in the readme Correcting a bash-sh issue adding a way to ensure that a daemon is stopped correcting upstart_ensure to ensure that the service is not restared adding images Removing binary file adding a readme multiple fixes following the talk last correction adding the biography push it for multiple sections initial commit Merge pull request #3 from gcmalloc/Phenitei-master\n\npython3 update adding python2-3 compatibility updating the README accordingly adding support for evening menu adding a regex to search trough restaurant Merge pull request #1 from maugier/master\n\nsetup.py, refactoring adding liscence removing python porn readme commit initial commit ssl for rpm Merge pull request #6 from antoinealb/master\n\nAdd support for system keychain Merge pull request #5 from antoinealb/master\n\nMinor improvements Merge pull request #4 from smarter/master\n\nFix for current Moodle + fix for setup.py bumping version adding logging adding a proper argument_parser correction on the option for the two argument version Take into account the case where the student is not registered to the course anymore change in module name renaming module to stop conflicting with menu a better README adding python3 compatibility checking remote timestamp before upgrade bump version changing the user interface, removing the password on the cli as it is bad practice a little fix for an IA course Correcting the usage ending sentence is better adding video support a without href, again updating version changing version correction when the url has parameters Merge branch 'master' of github.com:gcmalloc/epfl-moodle sometime a tag doesn't have a href Merge pull request #1 from antoinealb/master\n\nBetter usability correction on the url for the readme beautifulsoup4 dependencies updating version and setup.py formatting into functions correction on the readme cleaning around adding new function in the readme cleaning the repo adding usage better output on password adding logo adding empty password handling adding empty password handling correction on pdf redirection more output correction on empty pdf bug better readme adding a initialisation menu and configuration file unicode goodness removing useless method adding a download all function adding gitignore removing pyc proper packaging adding downloading document list of course and list of documents per course example for the library adding test initial commit Changing the import and fallback order for json\n\nThe json import order module imported the now obsolete django simplejson\nparser before the parser bundled with the standard python library. The\nnew import schema is:\n    1) json from the standard library\n    2) simplejson\n    3) simplejson from django, now osolete correcting typo on cuisine Update README.md adding readme add the ssh config bootstrap fabric ensure mongo is running adding parallel adding extensions improvement in the fab and slide initial commit yeah, thread pool to do the scan don't regenerate the ip range every time bug correction and logging saner library for mysql general cleaning and comments adding adding a global config file better readme moving README first complete version little time correction correcting table keys cleaning a bit working app return the right dict changing url to the one of the webapp better sql syntax better app adding static directory moving client files into the server directory adding scanner file, some test too Merge branch 'master' of ssh://git.fixme.ch:1337/ftp-scanner\nlittle merge new scanner version static to template adding empty main.html adding a barebone service app first scanner is now done, simply print the json for now Merge branch 'master' of ssh://git.fixme.ch:1337/ftp-scanner first try for the scanner adding database schema adding empty readme adding support for debian adding debian support be more lazy removing dependencies also don't manage dependencies if epel was not setup by this module adding a parameter to manage epel repository removing pip cache for the docker build adding doc on how to use this module fixing path for certificate template generation fixing a english based orthograph to a US based one fixing variable parameter checks missing comma adding support for state adding gitignore adding camptocamp requirement adding properties for epfl certificates initial commit don't test the haswait and hasCheck if iptables version uses flock adding octet unit Correct typos fixing test Add python and vim usually ignored file in gitignore one environment variable per line Merge remote-tracking branch 'atoulme/master'\n\n* atoulme/master:\n  Be aware of blue_anime color\n  Make changes to the exporter to expose build health Merge remote-tracking branch 'dotanga/filter_jobs'\n\n* dotanga/filter_jobs:\n  update the readme.md\n  add the filter from file list feature\n  add some debug data and check only for jenkins 2 Merge remote-tracking branch 'mumutu/master'\n\n* mumutu/master:\n  using newest client\n  add domain Merge remote-tracking branch 'delgod/master'\n\n* delgod/master:\n  add metric for current job state Merge remote-tracking branch 'fhemberger/feature/disable-tls-verification'\n\n* fhemberger/feature/disable-tls-verification:\n  Allow disabling of TLS cert verification Merge remote-tracking branch 'dmt/master'\n\n* dmt/master:\n  add build agent info to metrics Merge remote-tracking branch 'mst-ableton/add_flake8_check'\n\n* mst-ableton/add_flake8_check:\n  Add flake8 check to Travis builds.\n  Remove trailing whitespace. parse the server response correcting doc, adding some doc for the initialisation mandatory README adding license initial commit removing unused variable\n\nremoving unused variables adding lldp grain initial commit adding beerware \tnew file:   chiffres/90.wav\n\tnew file:   src/GUI/AudioReader.java\n\tmodified:   src/GUI/CommandCheckPanel.java\n\tmodified:   src/GUI/CommandPanel.java\n\tmodified:   src/GUI/CommandTirePanel.java\n\tnew file:   src/GUI/ErrorWindow.java\n\tnew file:   src/GUI/GenCommandPanel.java\n\tmodified:   src/GUI/LotoWindow.java\n\tmodified:   src/GUI/NumberBoard.java\n\tmodified:   src/GUI/NumbersSubPanel.java\n\tnew file:   src/GUI/WindowMenuBar.java\n\tmodified:   src/Main.java\n\tnew file:   src/MainControler.java\n\tnew file:   src/jeu/Jeu.java\n\tnew file:   src/listener/MainListener.java\n\tnew file:   src/main/Main.java\n\tdeleted:    hs_err_pid10356.log\n\tmodified:   src/GUI/CommandCheckPanel.java\n\tdeleted:    src/GUI/CommandListener.java\n\tmodified:   src/GUI/CommandPanel.java\n\tmodified:   src/GUI/CommandTirePanel.java\n\tdeleted:    src/GUI/Menu.java\n\tdeleted:    src/Jeu.java\n\tdeleted:    src/Main.java\n\tdeleted:    src/MainControler.java\n\tmodified:   src/main/Main.java Initial commit, three java files, a simple README, not much. Yay git! initial commit adding a discogs file to be used from discogs adding simple discogs search correcting gitignore little sorting makes searching faster correction on discid checksum for cddb adding the cddb checksum on directory adding length and bitrate adding comments, merging a cddb hash calculation cleaning a bit by removing a useless method adding cluster recognition correcting typo adding a wait if musicbrainz cannot handle our request anymore, commenting a bit more removing useless class, adding debug messages adding filecluster for path information detection adding filecluster for path information detection correcting request, getitem return the first match only updating gitignore sound signature detection is now done sound signature detection is now done pep8 for musicfile musicsorter is pep8 cleaning files gmusicbrainz addon move is corrected counting the file is now working Proper capitalization: little clean Proper capitalization is working cleaning some code and working copy little thing in musicbrainz adding skeleton of classes adding a class to handle the musicBrainz search adding gitignore correcting adding a better way to handle multiple format and multiple librairies to handle the tags removing space changing the source, adding url for documentation purpose checking style and correcting it, according to pep8 adding comment adding comment Adding comments Adding comments merging two local branches little changes in music_sorter adding flag, cleaning MusicWalker improving Params class refractoring a bit adding stuff going to 4 spaces as default indentation correcting identation adding a readme keep on putting the conditions into place creating thread and adding methods and one class to handle music directories the first one setting the default required group fix for dependencies on new gitlab versions upgrading omniauth dependency\nallow the programmer to specify a group that would have access to the application\nbumping omniauth version fail on errors adding travis hook correcting again the grammar nazi fixing grammar in a grammar bot adding insult typo correcting README First commit correcting a typo ugly fix only the data directory need to be checked the directories can also be either undef or empty string correcting the validate function fixing unquoted string replacing the relative import by absolute one adding doc adding validation function also fix the express tag support for structured facts Allow changes of the git remote in the warranty repo\n\nAs the git repository used to fetch the warranty script is down,\nthis changes permit the user to change the repository to another one. typo small fixes for the omniauth auth adding support for support email adding support for omniauth Changing facts to core_facsts adding dns zone tests adding test adding the allow query parameter default parameter for server option test fixes expliciti check fix function name the real parameter should be nil and not undef in spec test undef is not a number nor a string, test that before applying the checks adding stats test changing the is_ip check typo adding doc adding support for statistic in bind fixing the boolean operator another test approach for the undef adding little note in the readme for the check name policy changing the default to not write anything and let bind decide what the default is correcting rspec test check for the allow recursion string fixing param name correcting function name correcting test little fix on the way the content of a file is tested adding check for allow query adding a check for recursion adding check for the check name policy adding test for check name policy checking better check names adding @ for the template variable access adding input validation fix fixing template adding allow_query correction on the allow recursion disable check name, to allow people with _ in their entry to be happy little fix on variable name allow recursion a bit of documentation with an example better sentence no forward policy fix fixing the erb template empty forwarder correcting the except correcting the test adding more test correcting the test accordingly to the new options fixing the forwarders accordingly adding a policy setting for the forwarder change the variable name accordingly in the template tab to space adding test for the forward option validate the allow forwarder option correction on the forwarder name correction on the forwarder name correcting a typo Adding the stdlib dependency\n\nThis module was already used trough the array_validate in zone.pp.\nIt is now explicitely declared in the Modulefile. adding a allow forward option to a zone typo reverse url set the default version and provide a sane default adding bukkit plugin support correcting the dependencies refresh in case of new version small correction small correction adding eula typo also open the firewall port changing subscribe rule removing dependency from java minecraft service should be included by default changing user and group to minecraft adding service and download adding logstash output overwrite rdo priority absolute path for su adding the query_resource function in the README adding a salt minion key fact fixing a checking error little rollback allow to disable the installation of the smokeping package to be handled outside this module a more generic parameter acceptation for the probes replace package installation by the ensure_packages in the stdlib fixing each adding a generic option in a hash form adding subprocess group kill options correcting ceph url aesthetic correction and small typos renaming module name adding support for hash in the size function little correction renaming of the app cleaner pop method adding Var tuple late README is late lot of correction in the stack poping order first prototype. bug with ifz correcting the parser by adding the comment, cleaning a bit too parser and some basic memory The directory for the mp3 request was missformed, that is fixed now many update as the classes are created first commit better python packaging correcting a this into self adding a setup.py adding setup.py adding guard for the import of cPickle, adding the fallback to Pickle fixing markdown for image adding readme adding history adding install setup adding first rcon adding base rcon Uniforming the extension of the yaml files. adding missing url for kube-tools and kube-client in the kubernetes howto replacing the obsolete repository correcting the temporary file name adding documentation for the json stats collector correcting the test adding a json serializer for the stats Merge remote-tracking branch 'gh/master' removing empty line adding test for syntax on travis fixing exception handling removing ipython as a dependency, cleaning on the side don't create an empty buffer Merge pull request #2 from gcmalloc/readme\n\nReadme Merge pull request #1 from gcmalloc/readme\n\nReadme correcting indentation\n\nMore descriptive README\n\nUpdated README correcting indentation adding template adding template for reveal js Update README.md a bit better styling adding margin for the slide link and file grey pins as listing adding listing slides putting navbar in the layout better templating adding configuration handling no more border removing footer more cleaner argument passing setting the test remove the tempory directory simplyfying again the page removing double files many improvement on the test contains is replaced by in removing circular dependency adding my own stylesheet reverse japanese \" slides directory don't fail if the repository is updated only ignore readme adding help no more japanese test the new build directory path should only be taken from the parameter background task new dependencies{ removing japanese ensure that the directory is there more log when an issue occur payload is the container jsonify the response removing empty navigation bars renaming the appplication new compiled slide directory getting the good broker removing debug mode correcting directory name adding supervisor correction on the task adding test command adding a deploy script redis worker data format minimal set of feature adding note on ssh v1 fixing the setup.py to install the submodule too ignore the terraform command if no state exists adding installer small fixes cleaner condition os.path to replace raw string concatenation readme cleanup micro readme fixing remote initial commit replacing dhcpcd and sshd startup script by collectd correcting arch linux template Initial commit Initial commit test automation changing the template file extension making the script compatible with python3 little correction on the readme adding a proper bash-completion generation adding the script hook cleaning binaries getting version from git or failing removing the zip option, this can be done with python setup.py bdist --format=zip moving to setup.py correction on the test making the metacafe test pass adding second vimeo url skipping vimeo for the moment adding xnxx test adding collegehumor test adding stanford open class courses adding test for vimeo, xvideo and soundcloud correcting travis changing test from md5 to filesize, the file changed between download cleaning the test that doesn't work with the api for the moment some assertion on the file downloaded removing testing video correcting test to be compatible with python2.6 StringIO used by nosetests do not merge with the way youtube-dl handle sys.stdout and sys.stderr correction on the test adding travis support correcting the makefile according to the new one removing extended globbing for the find utility adding xvideo adding facebook test adding photobucket test adding metacafe test adding dailymotion test some changes to keep the same standard removing unused global modifier correcting the makefile changing test video correction on the test for the utils.py adding clean rule in the makefile adding download test with md5 check adding TestCase class and corresponding test correction on the sanitize title method, change in title resulting adding test rule in the Makefile Merge pull request #1 from gcmalloc/master\n\ntravis update more python version more pedantic travis updating travis travis is good putting echo into a variable File path separator tend to change following the course of history, and the will of the user Extension separator can change too fixing some fix for fixing the test and the clean adding a cd variable to handle custom written shell String should be parametrized Fix for haiku os Alignement is important the end I HOPE IT S THE LAST ONE Merge branch 'master' of github.com:paulpell/trafficHandling\n\nConflicts:\n\tcheck.md5 adding something in md5 hash adding a nice script to handle the md5 hash and remove the md5 we don't need adding a nice script to handle the md5 hash and remove the md5 we don't need last commit Merge branch 'master' of github.com:paulpell/trafficHandling Merge branch 'master' of github.com:paulpell/trafficHandling adding a way to check the md5 hash changing the run.sh, it will build the file automatically if the build dir didn't exist change name, add space Merge branch 'master' of github.com:paulpell/trafficHandling change name, add spaces change in the way we handle the signals some correction, syntax and comments adding import in TrafficLight.java a little one many change in name, added a class to handle everything nicely ",
      "nbWordsMessagePerCommit": "5.3"
    },
    "stats": {
      "Java": {
        "language": "Java",
        "nbCommit": 41,
        "nbWordsMessage": 335,
        "nbWordsMessagePerCommit": "8.2"
      },
      "Python": {
        "language": "Python",
        "nbCommit": 337,
        "nbWordsMessage": 1750,
        "nbWordsMessagePerCommit": "5.2"
      },
      "CSS": {
        "language": "CSS",
        "nbCommit": 56,
        "nbWordsMessage": 206,
        "nbWordsMessagePerCommit": "3.7"
      },
      "C#": {
        "language": "C#",
        "nbCommit": 1,
        "nbWordsMessage": 6,
        "nbWordsMessagePerCommit": "6.0"
      },
      "Shell": {
        "language": "Shell",
        "nbCommit": 8,
        "nbWordsMessage": 30,
        "nbWordsMessagePerCommit": "3.8"
      },
      "Ruby": {
        "language": "Ruby",
        "nbCommit": 77,
        "nbWordsMessage": 417,
        "nbWordsMessagePerCommit": "5.4"
      },
      "Puppet": {
        "language": "Puppet",
        "nbCommit": 47,
        "nbWordsMessage": 245,
        "nbWordsMessagePerCommit": "5.2"
      },
      "Go": {
        "language": "Go",
        "nbCommit": 3,
        "nbWordsMessage": 29,
        "nbWordsMessagePerCommit": "9.7"
      },
      "PureScript": {
        "language": "PureScript",
        "nbCommit": 1,
        "nbWordsMessage": 3,
        "nbWordsMessagePerCommit": "3.0"
      },
      "C": {
        "language": "C",
        "nbCommit": 4,
        "nbWordsMessage": 21,
        "nbWordsMessagePerCommit": "5.3"
      },
      "HTML": {
        "language": "HTML",
        "nbCommit": 1,
        "nbWordsMessage": 6,
        "nbWordsMessagePerCommit": "6.0"
      },
      "Vim script": {
        "language": "Vim script",
        "nbCommit": 1,
        "nbWordsMessage": 5,
        "nbWordsMessagePerCommit": "5.0"
      }
    }
  },
  "remij1": {
    "user": "remij1",
    "statsGlobal": {
      "nbCommits": 271,
      "nbWordsMessage": 1151,
      "messages": "Server side qui ne fonctionne pas du tout init server Master may works Merge branch 'master' of https://github.com/Ardgevald/PRR2017 Merge branch 'master' of https://github.com/Ardgevald/PRR2016 minor change Sending sync and follow_up Merge branch 'master' of https://github.com/Ardgevald/PRR2017 Début de réalisation Ajout d'entête de fichier Petite modif de commentaire Changement de nom du programme + petite mise en page 2ème activité Merge branch 'master' of https://github.com/remij1/SYM_Labo1 Question 4 (retour) done Question 2 (icon) ok relativeLayout Back ok 1ère partie fonctionne, reste questions Avancement de la deuxième activité, quitte sur l'émulateur Merge branch 'master' of https://github.com/remij1/SYM_Labo1 Début de la deuxième activité Ajout de l'activité ValidLogin ajout de password et test ok Commit initial avec template problème de meatball transformée en cabinet réglé Ajout du déployement docker et plus de donnée pré-générée Liste de fourniture par ordre décroissant afin de voir ce qu'on vient d'ajouter Problème de header résolu Modif titre fenêtre petite modif header Utilisation des includes pour header et footer Redirection depuis servlet pour édition Color en énum /generate plutôt que /generator Edit fonctionnel Merge branch 'fb-delete' Auto-complétion fonctionne sauf pour checked Merge branch 'fb-insert' into fb-edit Merge branch 'fb-insert' Servlet meuble à la racine Merge branch 'fb-pages' Problème page précédente réglée Insertion fonctionnelle Merge branch 'servlet' Génération fonctionnelle, mais fait planté si 2000000 d'insertion Pagination OK Affichage de la grille dans fourniture Petite modif generator Merge branch 'servlet' config mysql et wildfly lancés via docker-compose (pas le war) Ajout de close() dans FunrinutresManager pour fermer la connexion Lien avec BDD ok, mais pas d'auto-configuration wildfly Merge branch 'servlet' of https://github.com/remij1/AMT_Project01 into servlet Affichage d'une fourniture ok continuation MVC Generation de nom automatique Merge branch 'servlet' of https://github.com/remij1/AMT_Project01 into servlet Merge branch 'servlet' into fb-static-template bootstrap template Initial commit Modification de l'implémentation de RouletteServer Labo2 - All tests passed Résolution d'implémentation Ajout des tests PR - Fb_lab02_v2_contrib (remij1/aurelielevy) (#88)\n\n* Init testV2\r\n\r\n* RouletteV2Test\r\n\r\n* MAJ Tests Je crois que tout est fait, à vérifier ;) client à tester Ajout des Commande Load et Bye, implémentation serveur DONE Merge branch 'fb-lab02-v2-contrib' MAJ Tests Merge branch 'fb-lab02-v2-tests' of https://github.com/SoftEng-HEIGVD/Teaching-HEIGVD-RES-2017-Labo-02 into fb-lab02-v2-contrib La beauté du code RouletteV2Test Init testV2 Test passed MAJ getNextLine + ALL test passed FileNumbering : allTestsPassed DFS : all tests passed (application test too) DFS : tri par path Application : Tests 4/5 Modification de décorateur Uppercase Test passed Test DFS et Utils passed modif package.json quelques MAJ An array as a response (TCP) IP problems... JSON over UDP done, is it really what we have to do ? Starting musician Merge branch 'master' of https://github.com/remij1/Teaching-HEIGVD-RES-2017-Labo-SMTP Encoding problems solved MAH class diagram updated MD with classDiagramm MAJ md Merge branch 'master' of https://github.com/remij1/Teaching-HEIGVD-RES-2017-Labo-SMTP Modification Code + ajout JAR exécutable + test linux Suppression de la classe Group Wouuuuuhouu ca avance :P Ajout du mock utilisé PLein de truc CompanyName in SMTPCLient constructor SMTP CLient à revoir mais fonctionnel report v3 new version Report Sticky-session working It's now working ;-) It has to be debbuged ENV variables for containers IPs working oublis du fichier javascript adding from sources AJAX handling (LaboHTTP, 4 done) Minimum of computers returned changed to 0 modified static index.html (adding navbar, otherwise it dosn't work Update image, install VIM Images for apache rp, IP hardcoded (labo HTTP, 3c done) Docker image with Node running dynamicaly (returning HackedComputers) Docker express OK (2a) A part done Theme Petite modif sous-readme Merge branch 'master' of https://github.com/remij1/TWEB_Labo1_Node MAJ build Ajout de variable d'environnement pour heroku script start ajouté au package modif main du package.json MAJ ajout couleur MAJ agent Agent pour visuel ok MAJ agent pour design de type tree Petite modif agent Push sur github des données du repos regardé OK Récupération du nombre de commit par auteur Petite modifications de fichier Déplacement agent Create README.md Merge branch 'master' of https://github.com/remij1/TWEB_Labo1 Merge branch 'master' of https://github.com/remij1/TWEB_Labo1 MAJ build pipeline updatge readme Merge branch 'master' of https://github.com/remij1/TWEB_Labo1 MAJ readme new version of repo.json Merge branch 'master' of https://github.com/remij1/TWEB_Labo1 Update readme new version of repo.json new version of repo.json new version of repo.json new version of repo.json new version of repo.json new version of repo.json new version of repo.json new version of repo.json MAJ du readme Merge branch 'master' of https://github.com/remij1/TWEB_Labo1 MAJ subproject new version of repo.json Merge branch 'master' of https://github.com/remij1/TWEB_Labo1 build pipeline new version of repo.json new version of repo.json new version of repo.json new version of repo.json new version of repo.json new version of repo.json suppression du readme inutile new version of repo.json new version of repo.json new version of repo.json new version of repo.json new version of repo.json new version of repo.json new version of repo.json new version of repo.json new version of repo.json new version of repo.json new version of repo.json new version of repo.json new version of repo.json new version of repo.json new version of repo.json new version of repo.json new version of repo.json new version of repo.json new version of repo.json new version of repo.json new version of repo.json new version of repo.json new version of repo.json new version of repo.json new version of repo.json new version of repo.json new version of repo.json new version of repo.json new version of repo.json new version of repo.json new version of repo.json new version of repo.json new version of repo.json new version of repo.json new version of repo.json new version of repo.json new version of repo.json new version of repo.json new version of repo.json new version of repo.json new version of repo.json new version of repo.json new version of repo.json new version of repo.json new version of repo.json new version of repo.json new version of repo.json new version of repo.json new version of repo.json new version of repo.json new version of repo.json new version of repo.json new version of repo.json new version of repo.json new version of repo.json new version of repo.json new version of repo.json new version of repo.json new version of repo.json new version of repo.json changement de couleur MAJ agent new version of repo.json new version of repo.json new version of repo.json Affichage via repo.js Merge branch 'master' of https://github.com/remij1/TWEB_Labo1 new version of repo.json Merge branch 'master' of https://github.com/remij1/TWEB_Labo1 new version of repo.json Merge branch 'master' of https://github.com/remij1/TWEB_Labo1 MAJ agent new version of repo.json new version of repo.json new version of repo.json new version of repo.json MAJ Agent new version of repo.json new version of repo.json new version of repo.json eslint réglé Merge branch 'master' of https://github.com/remij1/TWEB_Labo1 launch config new version of repo.json new version of repo.json Merge branch 'master' of https://github.com/remij1/TWEB_Labo1 Modification Labo Node new version of repo Delete my-data-file.json new version of repo new version of repo new version of repo new version of repo in repo.js new version of repo new version of repo new version of repo new version of repo new version of the file new version of the file récup commit par auteur Modif Node Déplacement agent template static page Création d'index.html et du dossier docs Ajout du repo de Node en tant que submodule ",
      "nbWordsMessagePerCommit": "4.2"
    },
    "stats": {
      "Java": {
        "language": "Java",
        "nbCommit": 97,
        "nbWordsMessage": 446,
        "nbWordsMessagePerCommit": "4.6"
      },
      "JavaScript": {
        "language": "JavaScript",
        "nbCommit": 157,
        "nbWordsMessage": 625,
        "nbWordsMessagePerCommit": "4.0"
      },
      "CSS": {
        "language": "CSS",
        "nbCommit": 17,
        "nbWordsMessage": 80,
        "nbWordsMessagePerCommit": "4.7"
      }
    }
  },
  "Bykow": {
    "user": "Bykow",
    "statsGlobal": {
      "nbCommits": 416,
      "nbWordsMessage": 1898,
      "messages": "Saved the fucking WORLD UML Few comments in exemple for presentation Works on readme.md misc  Works. Fuck you ontoine v2 Merge remote-tracking branch 'origin/v2-impl' into v2-impl Fuck you ontoine RouletteProtocolV2 server impl  Works lel Fuck you Ontoine ??? Roulette V1 Impl functionnal Dernière correction du dossier task1 dans la task5. error correction Scripts ...booooring Derp Comments fixed readme Readme still tweaking for heroku heroku tweaking misc it works bitches rename output output maahh hum Fuck that new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file almost one day it will work ..... Merge branch 'master' of https://github.com/Bykow/dotfile Init Initial commit finished ? misc UI SHUTTHEFUCKUP Update .gitignore Update .gitignore  Done Work done Couldn't download Maven yet, did the code without testing... so far Recommited without .idea ... All tests green Done Port fixing Merge branch 'master' of https://github.com/Bykow/wroong Bootstrap base fixed? init commit new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file fixed readme Merge branch 'master' of https://github.com/Bykow/aliens_client readme?? new version of the file new version of the file Merge branch 'master' of https://github.com/Bykow/aliens_client readme new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file new version of the file Merge branch 'master' of https://github.com/Bykow/aliens_client Removed settings button new version of the file new version of the file new version of the file new version of the file new version of the file Changed title changed title Added bio misc Cleaned and centered c'est joli test Changed template docs folder cleaned init ",
      "nbWordsMessagePerCommit": "4.6"
    },
    "stats": {
      "Java": {
        "language": "Java",
        "nbCommit": 21,
        "nbWordsMessage": 70,
        "nbWordsMessagePerCommit": "3.3"
      },
      "CSS": {
        "language": "CSS",
        "nbCommit": 3,
        "nbWordsMessage": 11,
        "nbWordsMessagePerCommit": "3.7"
      },
      "JavaScript": {
        "language": "JavaScript",
        "nbCommit": 15,
        "nbWordsMessage": 24,
        "nbWordsMessagePerCommit": "1.6"
      },
      "Shell": {
        "language": "Shell",
        "nbCommit": 6,
        "nbWordsMessage": 15,
        "nbWordsMessagePerCommit": "2.5"
      },
      "C++": {
        "language": "C++",
        "nbCommit": 4,
        "nbWordsMessage": 5,
        "nbWordsMessagePerCommit": "1.3"
      },
      "HTML": {
        "language": "HTML",
        "nbCommit": 5,
        "nbWordsMessage": 12,
        "nbWordsMessagePerCommit": "2.4"
      }
    }
  },
  "wasadigi": {
    "user": "wasadigi",
    "statsGlobal": {
      "nbCommits": 376,
      "nbWordsMessage": 1935,
      "messages": "Publish first version Initial commit Restore h2 driver in standalone.xml Fixed a number of bugs and typos. Validation complete. Let's give a bit more time for the containers to start, before we do the check Add npm install in Dockerfile Validation procedure, with bash script and Docker image Fix other tables Fix 1st table Fix 1st table Instructions and directory layout Initial commit First version Initial commit Initial commit Version used for RES 2016 Update .gitignore Template for 15.10 can now be built locally and on atlas Remove old test Working Atlas configuration for ubuntu 15.04, but not for ubuntu 15.10 template.ubuntu.15.10.json is working, but still using ubuntu 12.04 Initial commit Initial commit Merge coolFeature Adding a cool page in the cool branch. adding a file called bidon Merge branch 'master' of https://github.com/wasadigi/javaee-template Modifying code2 Merge pull request #2 from wasadigi/quickfeature\n\nQuickfeature Merge master into quickfeature Modifying code2 Modifying code2 Modifying code Adding project files Adding project files Initial commit Create book.json Create styles/ebook.css Create styles/website.css Registration application. Hint added. Initial commit update readme by bob mod readme by bob Update by Alice, after rebase skip Conflicting edit by Bob Add comment in Bob2.java Adding a comment in Alice2 Merge branch 'master' of github.com:wasadigi/MyGitSandbox Adding Bob2.java Merge branch 'master' of github.com:wasadigi/MyGitSandbox Adding Alice2.java Merge branch 'master' of github.com:wasadigi/MyGitSandbox\n\nConflicts:\n\tMyGitSandboxProject/src/main/java/ch/heigvd/res/mygitsandboxproject/MyApplication.java Bob takes ownership of MyApplication.java (this will raise an issue...) Alice takes ownership of MyApplication.java Merge branch 'master' of github.com:wasadigi/MyGitSandbox Alice's first contribution to the project Bob's first contribution to the project Creating empty project structure Initial commit Initial commit Replace then() with done(), so that error callback is not swalled by revwalk walker Initial commit Fixing sub-module issue Getting rid of sub-git folder First documented version Initial commit Merge pull request #4 from SoftEng-HEIGVD/master\n\nCleaning up test files... Update test Merge pull request #3 from SoftEng-HEIGVD/master\n\nMerge pull request #1 from wasadigi/master Merge pull request #1 from wasadigi/master\n\nRemoving first test file. Merge pull request #2 from SoftEng-HEIGVD/master\n\nRemoving test files. Accepted. Merge pull request #1 from SoftEng-HEIGVD/master\n\nadding test file Initial commit Update README.md Initial commit Addling slides for day 2 (persistence) Adding domain model description Adding slides for day 1 Initial commit Delete last year's slides Commit slides 10 changes Typo in title slide Adding slides for Spring Framework Adding JMS slides Update tx slides Update project guidelines Adding slides for concurrency in practice update slide 04 Adding guidelines for phase 2, session 1 Adding slides for lecture 5 (transactions) and test 1 review Adding slides for week 4: REST Add slides for lecture 3 (Data Access Tier) Adding note to resource pooling with Java EE and Glassfish Adding slides 02 Adding slides for week 1 Removing last year's material Initial commit adding LDAP slides adding java ee 7 version of MonSysBackEnd adding slides for HTTP infrastructure Addling instructions for lab 1 Adding slides for course 1 (HTTP protocol) Adding slides for web services Adding slides for LDAP Fixing problem with previous upload (trac...) Adding application packages and README file Adding lab 2 Adding first batch of files Initial commit Adding evaluation grid Add missing content for phase 2 Update project description Fixed path to image reorganized specs files First draft of specifications Initial commit Adding slides 07 Adding slides HTTP protocol Adding slides for UDP, Node.js and Docker Add SMTP slides Add slides for TCP Add Java IO slides Adding slides for week 1, introduction Upadate README.md for 2017 Cleanup for 2017 Slides infra http Adding slides HTTP Adding lecture notes for HTTP and LDAP Fix typo in Docker example (UDP) Adding Docker slides Adding UDP slides Adding slides for SMTP Revert git test - ignore Quick git test - ignore Adding slides for TCP Adding examples Adding lecture notes 02 - TCP programming Adding content for Java IOs: slides and examples Temp. remove lecture notes - order and content might change this year Adding slides for first week: 00-Introduction Adding guidelines for first lab Nettoyage de printemps. Welcome to RES 2016 wrapping up 2015... wrapping up 2015... Adding LDAP slides Removing old numbered lecture notes Fixing image link Adding lecture notes for LDAP Adding hint for lab Removing legacy lecture notes Adding lecture notes for Web Infrasturcture Merge branch 'master' of github.com:wasadigi/Teaching-HEIGVD-RES Adding slides about Web Infrastructure Merge pull request #8 from Zoruk/master\n\nTypo and dead link Merge pull request #7 from BinaryBrain/patch-2\n\nUpdate 02-Lecture2-TCPProgramming.md Merge pull request #6 from BinaryBrain/patch-1\n\nUpdate 02-Lecture2-TCPProgramming.md Adding slides 04bis, step-by-step development of HTTP client library Adding HTTP slides Remove legacy 06 Adding HTTP lecture Adding slides 03 (UDP / Docker) Adding lecture 3 Update slides 02 Adding survey (vagrant) Adding slides 02 (TCP) Adding lecture 02 Update slides for Java IO Adding encoding example Buffered IO example (moved to maven) Adding example for File IO and Filters Adding slides for lectures 00 and 01 Adding lecture 01 (Java IO) Merge pull request #5 from AlphaHydrae/typo\n\nFixed a typo in the instructions for lab 00. Update README.md Temp version of lab 00 instructions Updating the README.md with the 2015 edition info It's spring. Let's do the yearly cleanup and start fresh. Update README.md Update README.md Fixed wrong project name in the instructions. Update 00-Introduction.md Update 00-Introduction.md Update 00-Introduction.md Initial commit Still some 01 refs to fix, moving to 00 Fix lab numbering issue: move 01 to 00 Cosmetic change Adding pull request instructions Updating instructions and adding diagrams Update instructions and add diagrams Fix logo urls Changing logos Adding logos Update diagram Update instructions and add diagrams iFLUX should not cause tests to fail if there is no Internet connection. Downgrading to java 7 in maven pom.xml Updating instructions Initial commit Adding note on naming for test class Merge pull request #1 from AlphaHydrae/v1-fix\n\nSwitched default roulette protocol version to v1 Adding note to add @TestAuthor annotations Update instructions Lab 02 Initial commit Merging bug fixes from teacher into my branch Fixing 2 bugs, one in code and one in tests Fixing the bug introduced by the teacher Fixing bugs in application code and unit tests getting rid of test-results.json add test-results.json to .gitignore Fixing bugs in application and unit tests reintroduce encoding bug, so that I can give instructions to students Restore production of test-results.json Broken application used as a starting point... all tests are RED :-( Adding workspace to .gitignore Adding instructions for lab 01 Adding diagrams Initial commit Merge branch 'master' into fb-orchestra New feature spec: let's play music together Implementation of first specs Update .gitignore Update instructions Update diagrams with new repo name (2016) Update diagrams with new repo name (2016) First version of diagrams First version of instructions Update .gitignore and LICENSE Add listeners to create a json file to store test results. Updated code to replace schoolpulse with probedock (on trial) Initial commit Complete requirements with minimal implementation Update .gitignore Update instructions Update diagrams with new repo name (2016) Update diagrams with new repo name (2016) First version of diagrams First version of instructions Update .gitignore and LICENSE Add listeners to create a json file to store test results. Updated code to replace schoolpulse with probedock (on trial) Initial commit Adding slides for web services Adding slides for LDAP Adding HTTP slides (infra) Adding slides and lab for HTTP remove old ICommand removed old ICommand Adding logic to UDP demo project and slides Adding UDP example Adding slides for concurrency Adding slides for lecture 3 (Socket API - TCP) Adding slides for Buffered IOs Adding one slide with the invocation chain (decorator pattern) Adding slides for Lecture 1 Initial commit Initial commit cleanup for new semester Adding slides 06 Adding slides for lecture 5, AngularJS Upate slides 004 with Mongoose examples Fix typo Merge branch 'master' of github.com:wasadigi/Teaching-HEIGVD-TWEB Adding slides 04: Mongo, Promises, async. Oktober Merge pull request #2 from AlphaHydrae/master\n\nApi copilot slides. Add slides for lecture 3 (REST) Remove temp slides folder Add slides for lecture 2 (node.js, express.js, yeoman) Commit new draft of lecture 2 slides Fix typo Slides for lecture 01 Getting rid of last year's content commit last year's leftovers Update README.md Initial commit update slides Adding lecture 2 keynote Adding lecture 2 pdf Adding slides 3 Material for week 1 Initial commit Adding slides for JMS adding link to Teams for POC Project adding slides 6 removing test file test Committing forgotten files... Adding 2 samples projects for Spring Adding link to REST Documentation page in wiki Adding link to REST Documentation page in wiki Adding first version the Fruits API Blueprint (WIP) Adding slides for Lectures 3 and 4 Adding persistence with JPA. Adding support for PUT and DELETE methods in the REST API. Adding slides for lecture 2. Initial commit of the Skeleton project Adding links to wiki Adding references Adding references. Adding references Adding references. Adding slides for lecture 1. Removing old slides Adding slides about JMS and transactions Adding slides on persistence Adding slides on Spring New slides for REST API design Adding slides for lecture 2 (Web Services) Adding slides for week 1 Initial commit Guidelines Initial commit Upgrade to Jenkins 2 and Blue Ocean Fix sh step in Jenkinsfile, variable passed to API Test container was wrong Fix procedure to check if Spring Boot app has been fully started: use the /health endpoint Update Jenkinsfile to wait for full start of clock micro-service, then execution of API tests by launching a Docker container Adding API tests written with supertest. Probe Dock not activated yet. Update Jenkinsfile to invoke 'mvn sonar:sonar' at commit stage; sonar URL configured in Jenkins job parameter Modified CD topology to start a SonarQube server next to the Jenkins server Resolve port conflict in runtime-topoloy. Replace single build parameter with 2 parameters, 1 for each microservice Update Jenkinsfile to build beers micro-service and to create a test env. with Docker Compose Created a docker image for beers micro-services. Created a topology for clock+beers microservices Beers micro-service implemented, with REST endpoint for CRUD operations and 1 finder Merge branch 'fb-jenkins-with-docker-compose' Add step to build clock microservice and image Update Jenkinsfile and add setup.groovy, so that we can install maven+node in Jenkins (setup.groovy) and get the sources of our microservices via git Adding a Docker Compose file to define a topology for our CD pipeline server Merge branch 'master' into fb-springboot Adding a Jenkinsfile that does nothing in 4 stages Adding a Docker image for our customized Jenkins. IMPORTANT: it fetches Jenkinsfile from https://github.com/wasadigi/Teaching-MSE-SEA-2016-MicroServices.git Added a Dockerfile and bash scripts to build and run the clock micro-service in a Docker container Code is complete: RESTful endpoint returns time in JSON and management endpoints are enabled Adding directories for content to be added in the future Initial commit Fixing bug, unit test should get green Version ready for students Initial commit First commit, with instructions and supporting files Initial commit Adding slides Lecture 8, software evolution Adding slides 07 Adding slides - agile testing Adding slides, lecture 05 Adding slides for lecture 04 Adding slides for lecture 3 Adding slides, lecture 2 Slides for lecture 1, intro Cleanup before 2016 Merge branch 'master' of github.com:wasadigi/Teaching-MSE-SoftwareEngineeringAndArchitecture Cleanup before 2016 Adding presentations about testing mocks Adding Lecture 5 - OO Reengineering Adding slides on software evolution Adding BDD slides Adding slides for lecture 02 Fixing course description First slides and course intro Cleanup for the new semester Updating slides on software evolution, to include reengineering slides Adding slides on software evolution Adding Sacha Labourey's slides. Adding BDD slides Slides for Lecture 6 Adding slides for the Octo workshop Adding slides for Lecture 3 and 4. testing again Testing. Adding slides for lecture 1. Initial commit Update index.html, again Update index.html Merge branch 'master' of github.com:wasadigi/tempTest Initial commit Add /cool endpoint Update feature1.txt ",
      "nbWordsMessagePerCommit": "5.1"
    },
    "stats": {
      "JavaScript": {
        "language": "JavaScript",
        "nbCommit": 41,
        "nbWordsMessage": 362,
        "nbWordsMessagePerCommit": "8.8"
      },
      "Java": {
        "language": "Java",
        "nbCommit": 109,
        "nbWordsMessage": 560,
        "nbWordsMessagePerCommit": "5.1"
      },
      "Shell": {
        "language": "Shell",
        "nbCommit": 8,
        "nbWordsMessage": 49,
        "nbWordsMessagePerCommit": "6.1"
      },
      "CSS": {
        "language": "CSS",
        "nbCommit": 4,
        "nbWordsMessage": 8,
        "nbWordsMessagePerCommit": "2.0"
      },
      "HTML": {
        "language": "HTML",
        "nbCommit": 5,
        "nbWordsMessage": 15,
        "nbWordsMessagePerCommit": "3.0"
      }
    }
  },
  "lognaume": {
    "user": "lognaume",
    "statsGlobal": {
      "nbCommits": 359,
      "nbWordsMessage": 1378,
      "messages": "Question 8 Gitignore Quickfix wrong package name refractoring Merge pull request #5 from Farenjihn/fb-14-gui\n\nBasic GUI Clean imports Package fixes Codestyle Merge branch 'master' into fb-14-gui Gitignore Add TestFX dependencies to gradle Merge branch 'fb-14-gui' of github.com:Farenjihn/pdg-heig into fb-14-gui Login form with mock actions Gradle with JavaFX API documentation template Merge branch 'master' of github.com:Farenjihn/pdg-heig Update README.md Get last release each startup Update & Delete Pagination working Moved in package & gradle dependencies Merge branch 'master' of github.com:lognaume/amt-project Create new kebabShop from UI Merge branch 'master' of github.com:lognaume/amt-project App loading data from MySQL Added PHPMyAdmin Basic shops list with local datastore First app showing static Kebab shop Merge branch 'master' of github.com:lognaume/amt-project HTML -> JSP Test tags Typo... Separate script and before_deploy Before deploy script Merge branch 'master' of github.com:lognaume/amt-project Skip cleanup Looking for the good file path Merge branch 'master' of github.com:lognaume/amt-project Changed repo name Execute travis on travis branch Travis Travis Travis Travis Travis Travis Test travis Gradle Merge branch 'master' of github.com:lognaume/amt-project Initial web app project Initial commit Jouer moins vite Bon JAR Factorise UML Marges et JAR Maxime est dans le rapport Rapport Fix compteur temps J'avais tout cassé Merge branch 'master' of github.com:gluthier/mcr-projet UML Merge branch 'master' of github.com:gluthier/mcr-projet Texte recommencer Jar Un peu de nettoyage Merge branch 'master' of github.com:gluthier/mcr-projet Gradle build Merge pull request #3 from gluthier/guillaume\n\nGuillaume Merge remote-tracking branch 'origin/commentBranch' into guillaume Merge remote-tracking branch 'origin/master' into guillaume Nettoyage Vitesse du jeu parametrable Je fais de la merde avec les fichiers de l'IDE Revert \".idea par erreur\"\n\nThis reverts commit 0465ee1b4588b2954ab777b7e235b35b637d3984. .idea par erreur Meilleure gestion déplacement .. Slower Merge pull request #2 from gluthier/guillaume\n\nVisiteur Merge remote-tracking branch 'origin/master' into guillaume Better use visitor Cleanup Merge pull request #1 from gluthier/guillaume\n\nAdaptation JavaFX Merge branch 'guillaume' of github.com:gluthier/mcr-projet into guillaume Fade out obstacles Use JavaFX only Game speed can be changed Typo in package name Added Visitor.xml Merge branch 'master' of github.com:gluthier/mcr-projet Documents folder + presentation added Merge branch 'master' of github.com:gluthier/mcr-projet pres ODP Admin.jar Merge branch 'master' of github.com:gluthier/GEN-projet Section 7 Jar Merge branch 'master' of github.com:gluthier/GEN-projet Fixe source path Merge pull request #49 from gluthier/jar_packaging\n\nJar packaging Merge Merge remote-tracking branch 'origin/master' into jar_packaging Merge remote-tracking branch 'origin/master' into jar_packaging Everything is packageable Jar packaging of client Merge pull request #47 from gluthier/client_game\n\nClient game Quick ugly fix Revert \"Fix protocole\"\n\nThis reverts commit 9b857140dea523aad69c937725cd4eec29051257. Fix protocole Multiplayer working Merge remote-tracking branch 'origin/server-party-implementation' into client_game Fix Merge remote-tracking branch 'origin/server-party-implementation' into client_game Check roles client side Client update from server Merge pull request #46 from gluthier/lobby\n\nUgly lobby done Lobby working bis Lobby working Fix game creation SOUT on protocol Missing \\n in protocol New game should appear in lobby Quickfix Create new party First working Lobby Merge pull request #44 from gluthier/39-tcp-client\n\nLogin OK Login working ! Added good JUnit version in protocol Merge branch 'server-improvement' into 39-tcp-client Corrections SYNTAXIQUES Merge remote-tracking branch 'origin/server-improvement' into 39-tcp-client Protocol testing in progress, few fixes done TCP Client test and better integration of the various controllers TCP client done Tests in progress ClientController done TCP Client done Merge branch 'master' into 39-tcp-client Client in progress TCP Client in progress Merge remote-tracking branch 'origin/master' into 39-tcp-client Merge remote-tracking branch 'origin/Server' into 39-tcp-client External GameController & grid Merge remote-tracking branch 'origin/master' into 19-obstacle-interaction new MainApp gitignore IntelliJ Fixed collision between groups Merge pull request #21 from gluthier/19-obstacle-interaction\n\nCollision OK Clean import Merge branch '19-obstacle-interaction' of github.com:gluthier/GEN-projet into 19-obstacle-interaction Collision OK fixes #19 Collision OK Funny looser text Merge branch 'skier' of github.com:gluthier/GEN-projet into skier Fixed collisionWithEdge() Merge pull request #17 from gluthier/issue-8-dynamic-sprite\n\nIssue 8 dynamic sprite done Comments Moved images sources to lighten the jar JavaFX Tests done, still exceptions JavaFX tests Working, TODO: Tests, comments Merge branch 'issue-8-dynamic-sprite' of github.com:gluthier/GEN-projet into issue-8-dynamic-sprite Cleanup Refractor Moving to Grid class instead of GridPane Refractoring in progress First working half dynamically game scene Load dynamically background image (for pane) Merge pull request #13 from gluthier/issue-8-dynamic-sprite\n\nIssue 8 dynamic sprite Wrong logo URL Merge branch 'master' of github.com:gluthier/GEN-projet Javafxpackager has be renamed Javapackager Improve resolution On rentre dans le placard Merge branch 'master' of github.com:gluthier/GEN-projet Rapport API Merge branch 'master' of github.com:gluthier/GEN-projet Rapport API Merge branch 'master' of github.com:gluthier/GEN-projet RM pdf Merge branch 'maxime' Merge branch 'master' of github.com:gluthier/GEN-projet Revert \"Merge branch 'master' of github.com:gluthier/GEN-projet\"\n\nThis reverts commit 19e89f3505cebf55e66193e3c3ae1bd4dfcfaeb7, reversing\nchanges made to 25d2a795f52603656e8b0ccd4ae0cd36aee62ba0. Merge branch 'master' of github.com:gluthier/GEN-projet Rapport Diagramme activité Alignement Merge branch 'master' of github.com:gluthier/GEN-projet DB section done, beginning of comm protocol Merge branch 'master' of github.com:gluthier/GEN-projet DB schéma Espacement Rendu Merge branch 'master' of github.com:lognaume/projet-semestre4 Inclusion cahier charges Merge branch 'master' of github.com:lognaume/projet-semestre4 Correction Merge branch 'master' of github.com:lognaume/projet-semestre4 modification Merge branch 'master' of github.com:lognaume/projet-semestre4 Correction Correction orthographiques Merge Merge branch 'master' of github.com:lognaume/projet-semestre4 Liste des figures Merge branch 'master' of github.com:lognaume/projet-semestre4 Mise en page Merge branch 'master' of github.com:lognaume/projet-semestre4 mise en page Merge branch 'master' of github.com:lognaume/projet-semestre4 Gantt final Merge branch 'master' of github.com:lognaume/projet-semestre4 Fix typo Fix history Merge branch 'master' of github.com:lognaume/projet-semestre4 Journal de travail Guillaume Merge branch 'master' of github.com:lognaume/projet-semestre4 Description technique Guillaume + modification annexes Export quickfix Merge pull request #140 from lognaume/fb-22-visualhistory\n\nFb 22 visualhistory Take symetry in account Fixes #22 Merge remote-tracking branch 'origin/master' into fb-22-visualhistory Cleanup & comments Visual history working Merge remote-tracking branch 'origin/master' into fb-22-visualhistory Merge remote-tracking branch 'origin/master' into fb-22-visualhistory Visual history in progress En cours Beginning Merge pull request #106 from lognaume/fb-13-history\n\nFb 13 history Merge remote-tracking branch 'origin/master' into fb-13-history Applied to all tools Merge remote-tracking branch 'origin/master' into fb-13-history Comment Merge remote-tracking branch 'origin/master' into fb-13-history History working Merge remote-tracking branch 'origin/master' into fb-13-history First working version for brush Merge remote-tracking branch 'origin/master' into fb-13-history First version Merge pull request #53 from lognaume/fb-26-copy-past\n\nFb 26 copy past Merge remote-tracking branch 'origin/master' into fb-26-copy-past AbstractTool Merge branch 'fb-26-copy-past' of github.com:lognaume/projet-semestre4 into fb-26-copy-past Merge remote-tracking branch 'origin/master' into fb-26-copy-past Copy/past OK fixes #26 Merge remote-tracking branch 'origin/master' into fb-26-copy-past rm idea file Cleanup Copy / past done. Fixes #26 Selection copy / past done Copy / past working with selection Copy / past from selection almost done Copy / past working with layers. Best exception management needed Merge remote-tracking branch 'origin/master' into fb-26-copy-past First implementation Merge remote-tracking branch 'origin/master' into fb-7-gestion-couleurs Merge branch 'master' into fb-7-gestion-couleurs Ignore IntelliJ files Revert \"Save color as Hue Saturation Brightness\"\n\nThis reverts commit d58146359297147ea029a41881d3f7433189bc41. Remove IDE config file.. Save color as Hue Saturation Brightness Merge remote-tracking branch 'origin/master' into fb-7-gestion-couleurs First version of popup oups Fixed Merge pull request #31 from lognaume/fb-3-interface\n\nFb 3 interface Comments First working interface with dynamic buttons Merge branch 'master' into fb-3-interface Create buttons dynamically Merge branch 'master' of github.com:lognaume/projet-semestre4 Added the project meister Typo bro Ajout GridPane Commit bidon Test Travis Empty project with Hello World example from Maven Organisation Répart Planning GANTT Merge branch 'master' of github.com:lognaume/projet-semestre2 Merge branch 'master' of github.com:lognaume/projet-semestre2 Merge branch 'master' of github.com:lognaume/projet-semestre2 Merge branch 'master' of github.com:lognaume/projet-semestre2 Merge branch 'cahier_charges' Mockups arrangement Mockups Création documents base Update README.md Report done Report done Merge Report in progress Gitignore Cleanup Modified startup script to inject ENV variables in PHP template and dynamically configure apache Loading locations using ajax Modified docker images to install vim Docker image for apache reverse proxy. WARNING: IP HARDCODED Return list of locations gitignore Added express-image Docker image static HTML with apache+php working and validated Initial commit Implementation of IInstrument, Trumpet and Flute according to specification Transformers done DFS done Application done UpperCase filter done & passing tests File numbering done & passing test getNextLine done & passing tests Best error management Comments All tests passing V2 working except 1 test Merge remote-tracking branch 'upstream/fb-lab02-v2-tests' into fb-lab02-v2-impl Fb lab02 v2 contrib (#159)\n\n* Implementation V1\r\n\r\n* Added 2 tests\r\n\r\n* Tests for protocol V2\r\n\r\n* Revert \"Added 2 tests\"\r\n\r\nThis reverts commit 243fa30cdd3e2f6a80f1144d72ab038b2701378a.\r\n\r\n* Revert \"Implementation V1\"\r\n\r\nThis reverts commit 4c557752291df3bdd3255726f66b11b93e2ad28d. Merge branch 'master' into fb-lab02-v2-impl Revert \"Implementation V1\"\n\nThis reverts commit 4c557752291df3bdd3255726f66b11b93e2ad28d. Revert \"Added 2 tests\"\n\nThis reverts commit 243fa30cdd3e2f6a80f1144d72ab038b2701378a. Tests for protocol V2 Use static commands Merge remote-tracking branch 'upstream/fb-lab02-v2-tests' into fb-lab02-v2-contrib Added 2 tests Implementation V1 Labo done Leprechaun Comment New test passing Merge remote-tracking branch 'upstream/master' First test passed Readme Update config Implementation Merge branch 'master' of github.com:gluthier/GEN-projet Application bidon Gitignore Gitignore Gitignore Rapport Gitignore Merge branch 'master' of github.com:gluthier/GEN-projet gitignore Fonctionnement général terminé Modifications selon retour Miguel Rapport Rapport gitignore Merge branch 'master' of github.com:gluthier/GEN-projet Rapport Gitignore Rename Planning example Initial commit ",
      "nbWordsMessagePerCommit": "3.8"
    },
    "stats": {
      "Java": {
        "language": "Java",
        "nbCommit": 343,
        "nbWordsMessage": 1315,
        "nbWordsMessagePerCommit": "3.8"
      },
      "CSS": {
        "language": "CSS",
        "nbCommit": 15,
        "nbWordsMessage": 61,
        "nbWordsMessagePerCommit": "4.1"
      },
      "JavaScript": {
        "language": "JavaScript",
        "nbCommit": 1,
        "nbWordsMessage": 2,
        "nbWordsMessagePerCommit": "2.0"
      }
    }
  },
  "Bertral": {
    "user": "Bertral",
    "statsGlobal": {
      "nbCommits": 155,
      "nbWordsMessage": 519,
      "messages": "Create README.md Create LICENSE mispelling Merge branch 'master' of https://github.com/Bertral/CoR executable ajouté rapport recompilé uml fix Merge branch 'master' of https://github.com/Bertral/CoR présentation + fix uml executable ajouté rapport v1 terminée, ajout du constructeur privé pour la classe colorUtils début rapport cleaning file structure constructeurs ajoutés à l'uml uml terminé début d'uml commenté 50% commenté + refactor ajout d'assets manquants début de commentage et refactoring du spawner terminé, à commenter Refactor terminé, TODO : prisme (nouvelle entité) + doc + fix hitboxes bleh Merge remote-tracking branch 'origin/master' bleh dernière version de CoRe faisant rebondir les tirs modif specs Merge branch 'master' of https://github.com/Bertral/CoR uml clarification du main sprite manquant ajouté pause (SPACEBAR), restart (R), explosions ! version alpha fonctionnelle sprites ajoutés pushé opti des étoiles joueur et mouvement, étoiles en background idée 2 approuvée par l'assistant interface ajoutée Exemple pour la présentation intermédiaire ajouté init Update .gitignore Initial commit minor correction in readme Update README.md\n\ndownload link Update README.md Update README.md jar files added project and output files v1 Initial commit tours infinis arret d'urgence documenté fonctionnel, à documenter, revoir l'arrêt d'urgence (il ne semble pas mettre fin aux threads) seemsgood classe locothread ajoutée bite trajectoire ne plante plus au démarrage gigitnore update init Delete .gitignore Initial commit commenté it just works fonctonnelle, plus qu'à faire le check qui empêche d'entrer une durée supérieure à la taille de la vidéo ui vide terminée bleeeh 2 boutons init Update README.md readme readme done Initial commit trumpet implemented nettoyage et commentaires tous les tests passent uppercase implémenté utils implémenté DFS passe les tests merge impl v2 V1+V2 passent les tests Merge branch 'fb-lab02-v2-tests' of https://github.com/SoftEng-HEIGVD/Teaching-HEIGVD-RES-2017-Labo-02 into v2-impl\n\n# Conflicts:\n#\t.gitignore tests unitaires ajoutés pour le groupe Friant et Stalder (#86)\n\n* Roulette V1 Impl functionnal\r\n\r\n* ???\r\n\r\n* tests unitaires ajoutés\r\n\r\n* Changes, import of the right version protocol... rollback partiel v1 port 2613, ordre de messages de loadstudents dwpoejfowaihgeéiaw Delete QuizRouletteServer-test.iml Delete QuizRouletteServer-code.iml Delete QuizRouletteServer-build.iml added ByeCommandResponse added LoadCommandResponse correction protocole listStudents clientv2 impl Delete RouletteV2GaussianBlursTest.java Delete RouletteV2JulienBrechetTest.java Merge branch 'fb-lab02-v2-tests' of https://github.com/SoftEng-HEIGVD/Teaching-HEIGVD-RES-2017-Labo-02 Merge branch 'master' of https://github.com/Bertral/Teaching-HEIGVD-RES-2017-Labo-HTTPInfra terminé correction mineure finito Merge branch 'master' of https://github.com/Bertral/Teaching-HEIGVD-RES-2017-Labo-HTTPInfra task4 terminée rapport task 4 task3 report task 2 rapport task1 ajout report.md task3 terminée détail rapport task2 task1 done validated ! presque rendu fuckshitfuckingshittycunt gitignore fix Initial commit journal journal antoine import inutilisé retiré fixed warnings de maven optimisation mineure génération d'anagrammes terminée recherche dans le dico fonctionnelle recherche dans le dico fonctionnelle TST commenté, champs \"Authors : Antoine Friant\" retirés TST implémenté, junit installé Merge remote-tracking branch 'origin/master' modules créés project init Merge branch 'master' of https://github.com/c-meier/HEIG-2017-PDG-WORDOFF init de la liste des outils à utiliser ajout du chat et du système de monaie à la plannif plannif initiale Directives refonte pagination/tri/filtre pour optimiser (et adhérer au exigences du prof) correction titre des pages README écrit, plus qu'à rendre commenté, terminé génération, ajout et affichage fonctionnels connexion db fonctionnelle dans docker ! wildfly console toujours inaccessible dans docker fuck you configsuccess.jsp TODO retiré réussi à récupérer un int nottoyage, création des pages de base scripts not found fixed nouveau template, plus qu'à faire tout le reste test typo Create README.md ",
      "nbWordsMessagePerCommit": "3.3"
    },
    "stats": {
      "Java": {
        "language": "Java",
        "nbCommit": 98,
        "nbWordsMessage": 341,
        "nbWordsMessagePerCommit": "3.5"
      },
      "C++": {
        "language": "C++",
        "nbCommit": 20,
        "nbWordsMessage": 66,
        "nbWordsMessagePerCommit": "3.3"
      },
      "CSS": {
        "language": "CSS",
        "nbCommit": 15,
        "nbWordsMessage": 34,
        "nbWordsMessagePerCommit": "2.3"
      },
      "JavaScript": {
        "language": "JavaScript",
        "nbCommit": 7,
        "nbWordsMessage": 11,
        "nbWordsMessagePerCommit": "1.6"
      },
      "HTML": {
        "language": "HTML",
        "nbCommit": 15,
        "nbWordsMessage": 67,
        "nbWordsMessagePerCommit": "4.5"
      }
    }
  },
  "Rhod3": {
    "user": "Rhod3",
    "statsGlobal": {
      "nbCommits": 292,
      "nbWordsMessage": 1141,
      "messages": "small corrections added modified by Merge branch 'master' of github.com:BasileChatillon/Teaching-HEIGVD-RES-2017-Labo-02 deleted useless import comments all tests for V1 implementation test comment Small corrections and delete useless functions Proper link to access ressources Handle new location of dictionary file New proper location for dictionary file Merge branch 'pdg19_dictionary' of https://github.com/Farenjihn/pdg-heig into pdg19_dictionary Added a way to handle different dictionary language. Also added standart File.separator for the path Simple function to permutate a string Dictionary class implemented, we can check if a word is in the dictionary. Basic Ternary Search Tree implementation Added files containing letters frequency and concrete list of allowed words more cleaning cleaning pep8 find_games now handles multiple red cartridges find_game now handles stream video input initial file pep8 more tests initial commit feur README clarification correction update Update README-md correction of method for the ranodm generation of groups update modified sender and receiver handling in mail body Merge branch 'master' of github.com:Rhod3/Mail_Spammer working spammer+ Create README.md added group creator, working reading email adresses from file added spam handler added group handler added example data initial commit, mail sender working Merge branch 'master' of github.com:Rhod3/Mail_Spammer gitignore Initial commit final commit Initial commit, basic Android Studio project More detailed comments File separator + delete some comments more doc doc UpperCase filter ok transformers tests ok application pass tests correction in the DFS explorer Utils pass tests FileNumbering passing tests UpperCaseFilterWriter DFSFileExplorer passing test check.log finally working update correction in the js structure Dockerfiles prototype of auditor.js first prototype for musician.js app final commit, not everything is working tests pass created eRemoverStreamProcessor report final update rapport done Traefik ok first try to configure traefik update rapport demo ready report part 1 and 2a personal content ok update report Modified startup script to include ip adress of static and dynamic site as ENV variables correction of apache2-foregrounf to respect the new config methodology Merge branch 'fb-ajax-jquery' into fb-dynamic-configuration step 4 operationnal config-template.php draft step 5b, created required file, not tested yet report for step 4, not functionnal yet Step3c, image apache-reverse-proxy done. WARNING: IP HARDCODED doc step 3b fin du rapport step 2 update rapport exemple students exemple génération de students aléatoire express app example end of video 2b: simple node app demo added report added free css template config Dockerfile Docs Heroku tweak Heroku tweak console.log Heroku tweak ReadMe Cleared debug output Simple ReadMe created Merge branch 'master' of github.com:Rhod3/TWEB2017-Github-Analytics-Server Create README.md Added Procfile to fix a bug in Heroku Heroku tweak Fixed some socket hang up bug Heroku prep Eslint small fix Fixed bug in test wip Heroku tweaking Code cleaning Agent can now update file. Commit page now works with pagination Correctly handle pagination for repos fetching Corrected data format Data calculation completed Cleaning Complete data creation Simple data creation Work In Progress, data calculation for all commits Function now handles repo languages Function to get all commits from one user (and test for this function Deleted github-creds Update .gitignore Agent implemented, can now fetch all repos from a user Cleaning node_modules Added gitignore Async with callback(2): simple client.js implementation, passing test Wrote simple client.js test Added mocha, chai and dirty-chai to dev dependencies Initial nodejs structure Initial commit Updated Data 2017-10-22 14:00:47 Updated Data 2017-10-22 12:42:54 Docs + report Updated Data 2017-10-21 14:00:37 Update data.json Updated Data 2017-10-21 13:30:43 UI Improvments Merge branch 'master' of github.com:Rhod3/TWEB2017-Github-Analytics UI Fixes Update data.json Merge branch 'master' of github.com:Rhod3/TWEB2017-Github-Analytics UI fix Updated Data 2017-10-21 12:47:23 Merge branch 'master' of github.com:Rhod3/TWEB2017-Github-Analytics Small UI fixes Updated Data 2017-10-21 12:30:16 Updated Data 2017-10-21 12:23:11 Merge branch 'master' of github.com:Rhod3/TWEB2017-Github-Analytics Changed ignored word for the word cloud Updated Data 2017-10-21 12:11:13 Update data.json Updated Data 2017-10-21 11:57:10 Updated Data 2017-10-21 11:57:05 Updated Data 2017-10-21 11:52:44 Updated Data 2017-10-21 11:31:01 Updated Data 2017-10-21 11:17:10 Updated Data 2017-10-21 10:47:53 Updated Data 2017-10-21 10:20:47 Updated Data 2017-10-21 10:08:41 Updated Data 2017-10-21 09:57:51 Updated Data 2017-10-21 09:43:32 Updated Data 2017-10-21 09:23:16 Updated Data 2017-10-21 09:10:08 Updated Data 2017-10-21 08:27:53 Updated Data 2017-10-21 08:14:53 Updated Data 2017-10-21 07:47:01 Updated Data 2017-10-21 07:34:47 Updated Data 2017-10-21 07:23:39 Updated Data 2017-10-21 07:07:45 Updated Data 2017-10-21 06:44:32 Updated Data 2017-10-21 06:17:35 Updated Data 2017-10-21 05:52:05 Updated Data 2017-10-21 05:26:10 Updated Data 2017-10-21 05:12:02 Updated Data 2017-10-21 04:57:55 Updated Data 2017-10-21 04:31:50 Updated Data 2017-10-21 04:15:47 Updated Data 2017-10-21 04:02:24 Updated Data 2017-10-21 03:48:14 Updated Data 2017-10-21 03:33:20 Updated Data 2017-10-21 03:21:12 Updated Data 2017-10-21 03:05:16 Updated Data 2017-10-21 02:48:59 Updated Data 2017-10-21 02:37:15 Updated Data 2017-10-21 02:23:54 Updated Data 2017-10-21 02:12:50 Updated Data 2017-10-21 01:43:46 Updated Data 2017-10-21 01:27:36 Updated Data 2017-10-21 01:13:35 Updated Data 2017-10-21 00:57:36 Updated Data 2017-10-21 00:50:13 Merge branch 'master' of github.com:Rhod3/TWEB2017-Github-Analytics Fix Updated Data 2017-10-21 00:40:20 Updated Data 2017-10-21 00:40:10 Merge branches 'master' and 'master' of github.com:Rhod3/TWEB2017-Github-Analytics Fixes word cloud Updated Data 2017-10-21 00:21:26 Updated Data 2017-10-21 00:07:08 Updated Data 2017-10-20 23:48:08 Updated Data 2017-10-20 23:35:01 Updated Data 2017-10-20 23:11:48 Updated Data 2017-10-20 22:57:50 Updated Data 2017-10-20 22:35:42 Updated Data 2017-10-20 22:13:26 Updated Data 2017-10-20 21:59:38 Updated Data 2017-10-20 21:48:14 Updated Data 2017-10-20 21:29:03 Updated Data 2017-10-20 21:05:26 Updated Data 2017-10-20 20:49:01 Updated Data 2017-10-20 20:30:43 Updated Data 2017-10-20 20:13:07 Updated Data 2017-10-20 19:55:46 Updated Data 2017-10-20 19:40:32 Merge branch 'master' of github.com:Rhod3/TWEB2017-Github-Analytics First try for word cloud Updated Data 2017-10-20 19:17:56 Updated Data 2017-10-20 19:17:42 Updated Data 2017-10-20 19:05:24 Small fixes v2 Small fixes Merge branch 'master' of github.com:Rhod3/TWEB2017-Github-Analytics Try to only display message stats Updated Data 2017-10-20 18:37:22 Updated Data 2017-10-20 18:12:05 readme Updated Data 2017-10-20 17:57:10 Updated Data 2017-10-20 17:44:55 Updated Data 2017-10-20 17:34:43 Updated Data 2017-10-20 16:06:51 Update data.json Update data.json Updated Data 2017-10-20 08:04:06 Updated Data 2017-10-20 02:35:17 Updated Data 2017-10-19 20:49:47 Updated Data 2017-10-19 17:51:04 Updated Data 2017-10-19 16:25:21 Updated Data 2017-10-19 15:36:53 Updated Data 2017-10-19 15:30:31 Updated Data 2017-10-19 15:12:27 Updated Data 2017-10-19 15:00:24 Updated Data 2017-10-19 14:42:28 Updated Data 2017-10-19 13:36:13 Updated Data 2017-10-19 13:24:35 Updated Data 2017-10-19 12:59:16 Update data.json Update data.json Updated Data 2017-10-19 11:43:40 Updated Data 2017-10-18 15:48:27 Chart should now scale from 0 all the times Fixed bug that displayed old data into chart Updated Data 2017-10-17 17:53:20 Re-added wasadigi Updated Data 2017-10-17 17:37:52 Added user wasadigi to be processed by the crawler Updated Data 2017-10-17 17:33:43 Test with filled data User select and chart WIP14 Onchange function for the select Select should correctly be filled User select and chart WIP13 User select and chart WIP12 User select and chart WIP11 User select and chart WIP10 User select and chart WIP10 User select and chart WIP9 User select and chart WIP8 User select and chart WIP7 User select and chart WIP6 User select and chart WIP5 User select WIP4 User select WIP3 User select v2 Added select creation Visualisation v5 Visualisation v4 Visualisation v3 Visualisation v2 Data visualisation test little cleaning Fix docs Preparation for github.io Preparation for data visualisation Customised template Initial bootstrap template Added simple ReadMe ",
      "nbWordsMessagePerCommit": "3.9"
    },
    "stats": {
      "Java": {
        "language": "Java",
        "nbCommit": 53,
        "nbWordsMessage": 219,
        "nbWordsMessagePerCommit": "4.1"
      },
      "Python": {
        "language": "Python",
        "nbCommit": 9,
        "nbWordsMessage": 23,
        "nbWordsMessagePerCommit": "2.6"
      },
      "JavaScript": {
        "language": "JavaScript",
        "nbCommit": 47,
        "nbWordsMessage": 169,
        "nbWordsMessagePerCommit": "3.6"
      },
      "CSS": {
        "language": "CSS",
        "nbCommit": 26,
        "nbWordsMessage": 118,
        "nbWordsMessagePerCommit": "4.5"
      }
    }
  }
}